Date and time: 2019-03-30 11-24-56

Datasets used: ['/home/vostankovich/CycleGANToD/results/day2night_inno_cyclegan/test_latest/images']

894
447
DOING AUGMENTATION
DOING GAN
Model summary:
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
data (InputLayer)               (None, 256, 640, 3)  0                                            
__________________________________________________________________________________________________
bn_data (BatchNormalization)    (None, 256, 640, 3)  9           data[0][0]                       
__________________________________________________________________________________________________
zero_padding2d_1 (ZeroPadding2D (None, 262, 646, 3)  0           bn_data[0][0]                    
__________________________________________________________________________________________________
conv0 (Conv2D)                  (None, 128, 320, 64) 9408        zero_padding2d_1[0][0]           
__________________________________________________________________________________________________
bn0 (BatchNormalization)        (None, 128, 320, 64) 256         conv0[0][0]                      
__________________________________________________________________________________________________
relu0 (Activation)              (None, 128, 320, 64) 0           bn0[0][0]                        
__________________________________________________________________________________________________
zero_padding2d_2 (ZeroPadding2D (None, 130, 322, 64) 0           relu0[0][0]                      
__________________________________________________________________________________________________
pooling0 (MaxPooling2D)         (None, 64, 160, 64)  0           zero_padding2d_2[0][0]           
__________________________________________________________________________________________________
stage1_unit1_bn1 (BatchNormaliz (None, 64, 160, 64)  256         pooling0[0][0]                   
__________________________________________________________________________________________________
stage1_unit1_relu1 (Activation) (None, 64, 160, 64)  0           stage1_unit1_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_3 (ZeroPadding2D (None, 66, 162, 64)  0           stage1_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage1_unit1_conv1 (Conv2D)     (None, 64, 160, 64)  36864       zero_padding2d_3[0][0]           
__________________________________________________________________________________________________
stage1_unit1_bn2 (BatchNormaliz (None, 64, 160, 64)  256         stage1_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage1_unit1_relu2 (Activation) (None, 64, 160, 64)  0           stage1_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_4 (ZeroPadding2D (None, 66, 162, 64)  0           stage1_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage1_unit1_conv2 (Conv2D)     (None, 64, 160, 64)  36864       zero_padding2d_4[0][0]           
__________________________________________________________________________________________________
stage1_unit1_sc (Conv2D)        (None, 64, 160, 64)  4096        stage1_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_1 (Add)                     (None, 64, 160, 64)  0           stage1_unit1_conv2[0][0]         
                                                                 stage1_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage1_unit2_bn1 (BatchNormaliz (None, 64, 160, 64)  256         add_1[0][0]                      
__________________________________________________________________________________________________
stage1_unit2_relu1 (Activation) (None, 64, 160, 64)  0           stage1_unit2_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_5 (ZeroPadding2D (None, 66, 162, 64)  0           stage1_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage1_unit2_conv1 (Conv2D)     (None, 64, 160, 64)  36864       zero_padding2d_5[0][0]           
__________________________________________________________________________________________________
stage1_unit2_bn2 (BatchNormaliz (None, 64, 160, 64)  256         stage1_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage1_unit2_relu2 (Activation) (None, 64, 160, 64)  0           stage1_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_6 (ZeroPadding2D (None, 66, 162, 64)  0           stage1_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage1_unit2_conv2 (Conv2D)     (None, 64, 160, 64)  36864       zero_padding2d_6[0][0]           
__________________________________________________________________________________________________
add_2 (Add)                     (None, 64, 160, 64)  0           stage1_unit2_conv2[0][0]         
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
stage2_unit1_bn1 (BatchNormaliz (None, 64, 160, 64)  256         add_2[0][0]                      
__________________________________________________________________________________________________
stage2_unit1_relu1 (Activation) (None, 64, 160, 64)  0           stage2_unit1_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_7 (ZeroPadding2D (None, 66, 162, 64)  0           stage2_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage2_unit1_conv1 (Conv2D)     (None, 32, 80, 128)  73728       zero_padding2d_7[0][0]           
__________________________________________________________________________________________________
stage2_unit1_bn2 (BatchNormaliz (None, 32, 80, 128)  512         stage2_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage2_unit1_relu2 (Activation) (None, 32, 80, 128)  0           stage2_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_8 (ZeroPadding2D (None, 34, 82, 128)  0           stage2_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage2_unit1_conv2 (Conv2D)     (None, 32, 80, 128)  147456      zero_padding2d_8[0][0]           
__________________________________________________________________________________________________
stage2_unit1_sc (Conv2D)        (None, 32, 80, 128)  8192        stage2_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_3 (Add)                     (None, 32, 80, 128)  0           stage2_unit1_conv2[0][0]         
                                                                 stage2_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage2_unit2_bn1 (BatchNormaliz (None, 32, 80, 128)  512         add_3[0][0]                      
__________________________________________________________________________________________________
stage2_unit2_relu1 (Activation) (None, 32, 80, 128)  0           stage2_unit2_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_9 (ZeroPadding2D (None, 34, 82, 128)  0           stage2_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage2_unit2_conv1 (Conv2D)     (None, 32, 80, 128)  147456      zero_padding2d_9[0][0]           
__________________________________________________________________________________________________
stage2_unit2_bn2 (BatchNormaliz (None, 32, 80, 128)  512         stage2_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage2_unit2_relu2 (Activation) (None, 32, 80, 128)  0           stage2_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_10 (ZeroPadding2 (None, 34, 82, 128)  0           stage2_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage2_unit2_conv2 (Conv2D)     (None, 32, 80, 128)  147456      zero_padding2d_10[0][0]          
__________________________________________________________________________________________________
add_4 (Add)                     (None, 32, 80, 128)  0           stage2_unit2_conv2[0][0]         
                                                                 add_3[0][0]                      
__________________________________________________________________________________________________
stage3_unit1_bn1 (BatchNormaliz (None, 32, 80, 128)  512         add_4[0][0]                      
__________________________________________________________________________________________________
stage3_unit1_relu1 (Activation) (None, 32, 80, 128)  0           stage3_unit1_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_11 (ZeroPadding2 (None, 34, 82, 128)  0           stage3_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage3_unit1_conv1 (Conv2D)     (None, 16, 40, 256)  294912      zero_padding2d_11[0][0]          
__________________________________________________________________________________________________
stage3_unit1_bn2 (BatchNormaliz (None, 16, 40, 256)  1024        stage3_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage3_unit1_relu2 (Activation) (None, 16, 40, 256)  0           stage3_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_12 (ZeroPadding2 (None, 18, 42, 256)  0           stage3_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage3_unit1_conv2 (Conv2D)     (None, 16, 40, 256)  589824      zero_padding2d_12[0][0]          
__________________________________________________________________________________________________
stage3_unit1_sc (Conv2D)        (None, 16, 40, 256)  32768       stage3_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_5 (Add)                     (None, 16, 40, 256)  0           stage3_unit1_conv2[0][0]         
                                                                 stage3_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage3_unit2_bn1 (BatchNormaliz (None, 16, 40, 256)  1024        add_5[0][0]                      
__________________________________________________________________________________________________
stage3_unit2_relu1 (Activation) (None, 16, 40, 256)  0           stage3_unit2_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_13 (ZeroPadding2 (None, 18, 42, 256)  0           stage3_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage3_unit2_conv1 (Conv2D)     (None, 16, 40, 256)  589824      zero_padding2d_13[0][0]          
__________________________________________________________________________________________________
stage3_unit2_bn2 (BatchNormaliz (None, 16, 40, 256)  1024        stage3_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage3_unit2_relu2 (Activation) (None, 16, 40, 256)  0           stage3_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_14 (ZeroPadding2 (None, 18, 42, 256)  0           stage3_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage3_unit2_conv2 (Conv2D)     (None, 16, 40, 256)  589824      zero_padding2d_14[0][0]          
__________________________________________________________________________________________________
add_6 (Add)                     (None, 16, 40, 256)  0           stage3_unit2_conv2[0][0]         
                                                                 add_5[0][0]                      
__________________________________________________________________________________________________
stage4_unit1_bn1 (BatchNormaliz (None, 16, 40, 256)  1024        add_6[0][0]                      
__________________________________________________________________________________________________
stage4_unit1_relu1 (Activation) (None, 16, 40, 256)  0           stage4_unit1_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_15 (ZeroPadding2 (None, 18, 42, 256)  0           stage4_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage4_unit1_conv1 (Conv2D)     (None, 8, 20, 512)   1179648     zero_padding2d_15[0][0]          
__________________________________________________________________________________________________
stage4_unit1_bn2 (BatchNormaliz (None, 8, 20, 512)   2048        stage4_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage4_unit1_relu2 (Activation) (None, 8, 20, 512)   0           stage4_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_16 (ZeroPadding2 (None, 10, 22, 512)  0           stage4_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage4_unit1_conv2 (Conv2D)     (None, 8, 20, 512)   2359296     zero_padding2d_16[0][0]          
__________________________________________________________________________________________________
stage4_unit1_sc (Conv2D)        (None, 8, 20, 512)   131072      stage4_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_7 (Add)                     (None, 8, 20, 512)   0           stage4_unit1_conv2[0][0]         
                                                                 stage4_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage4_unit2_bn1 (BatchNormaliz (None, 8, 20, 512)   2048        add_7[0][0]                      
__________________________________________________________________________________________________
stage4_unit2_relu1 (Activation) (None, 8, 20, 512)   0           stage4_unit2_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_17 (ZeroPadding2 (None, 10, 22, 512)  0           stage4_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage4_unit2_conv1 (Conv2D)     (None, 8, 20, 512)   2359296     zero_padding2d_17[0][0]          
__________________________________________________________________________________________________
stage4_unit2_bn2 (BatchNormaliz (None, 8, 20, 512)   2048        stage4_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage4_unit2_relu2 (Activation) (None, 8, 20, 512)   0           stage4_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_18 (ZeroPadding2 (None, 10, 22, 512)  0           stage4_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage4_unit2_conv2 (Conv2D)     (None, 8, 20, 512)   2359296     zero_padding2d_18[0][0]          
__________________________________________________________________________________________________
add_8 (Add)                     (None, 8, 20, 512)   0           stage4_unit2_conv2[0][0]         
                                                                 add_7[0][0]                      
__________________________________________________________________________________________________
bn1 (BatchNormalization)        (None, 8, 20, 512)   2048        add_8[0][0]                      
__________________________________________________________________________________________________
relu1 (Activation)              (None, 8, 20, 512)   0           bn1[0][0]                        
__________________________________________________________________________________________________
decoder_stage0_conv1 (Conv2D)   (None, 8, 20, 128)   65536       relu1[0][0]                      
__________________________________________________________________________________________________
decoder_stage0_bn1 (BatchNormal (None, 8, 20, 128)   512         decoder_stage0_conv1[0][0]       
__________________________________________________________________________________________________
decoder_stage0_relu1 (Activatio (None, 8, 20, 128)   0           decoder_stage0_bn1[0][0]         
__________________________________________________________________________________________________
decoder_stage0_upsample2 (UpSam (None, 16, 40, 128)  0           decoder_stage0_relu1[0][0]       
__________________________________________________________________________________________________
decoder_stage0_conv2 (Conv2D)   (None, 16, 40, 128)  147456      decoder_stage0_upsample2[0][0]   
__________________________________________________________________________________________________
decoder_stage0_bn2 (BatchNormal (None, 16, 40, 128)  512         decoder_stage0_conv2[0][0]       
__________________________________________________________________________________________________
decoder_stage0_relu2 (Activatio (None, 16, 40, 128)  0           decoder_stage0_bn2[0][0]         
__________________________________________________________________________________________________
decoder_stage0_conv3 (Conv2D)   (None, 16, 40, 256)  32768       decoder_stage0_relu2[0][0]       
__________________________________________________________________________________________________
decoder_stage0_bn3 (BatchNormal (None, 16, 40, 256)  1024        decoder_stage0_conv3[0][0]       
__________________________________________________________________________________________________
decoder_stage0_relu3 (Activatio (None, 16, 40, 256)  0           decoder_stage0_bn3[0][0]         
__________________________________________________________________________________________________
add_9 (Add)                     (None, 16, 40, 256)  0           decoder_stage0_relu3[0][0]       
                                                                 stage4_unit1_relu1[0][0]         
__________________________________________________________________________________________________
decoder_stage1_conv1 (Conv2D)   (None, 16, 40, 64)   16384       add_9[0][0]                      
__________________________________________________________________________________________________
decoder_stage1_bn1 (BatchNormal (None, 16, 40, 64)   256         decoder_stage1_conv1[0][0]       
__________________________________________________________________________________________________
decoder_stage1_relu1 (Activatio (None, 16, 40, 64)   0           decoder_stage1_bn1[0][0]         
__________________________________________________________________________________________________
decoder_stage1_upsample2 (UpSam (None, 32, 80, 64)   0           decoder_stage1_relu1[0][0]       
__________________________________________________________________________________________________
decoder_stage1_conv2 (Conv2D)   (None, 32, 80, 64)   36864       decoder_stage1_upsample2[0][0]   
__________________________________________________________________________________________________
decoder_stage1_bn2 (BatchNormal (None, 32, 80, 64)   256         decoder_stage1_conv2[0][0]       
__________________________________________________________________________________________________
decoder_stage1_relu2 (Activatio (None, 32, 80, 64)   0           decoder_stage1_bn2[0][0]         
__________________________________________________________________________________________________
decoder_stage1_conv3 (Conv2D)   (None, 32, 80, 128)  8192        decoder_stage1_relu2[0][0]       
__________________________________________________________________________________________________
decoder_stage1_bn3 (BatchNormal (None, 32, 80, 128)  512         decoder_stage1_conv3[0][0]       
__________________________________________________________________________________________________
decoder_stage1_relu3 (Activatio (None, 32, 80, 128)  0           decoder_stage1_bn3[0][0]         
__________________________________________________________________________________________________
add_10 (Add)                    (None, 32, 80, 128)  0           decoder_stage1_relu3[0][0]       
                                                                 stage3_unit1_relu1[0][0]         
__________________________________________________________________________________________________
decoder_stage2_conv1 (Conv2D)   (None, 32, 80, 32)   4096        add_10[0][0]                     
__________________________________________________________________________________________________
decoder_stage2_bn1 (BatchNormal (None, 32, 80, 32)   128         decoder_stage2_conv1[0][0]       
__________________________________________________________________________________________________
decoder_stage2_relu1 (Activatio (None, 32, 80, 32)   0           decoder_stage2_bn1[0][0]         
__________________________________________________________________________________________________
decoder_stage2_upsample2 (UpSam (None, 64, 160, 32)  0           decoder_stage2_relu1[0][0]       
__________________________________________________________________________________________________
decoder_stage2_conv2 (Conv2D)   (None, 64, 160, 32)  9216        decoder_stage2_upsample2[0][0]   
__________________________________________________________________________________________________
decoder_stage2_bn2 (BatchNormal (None, 64, 160, 32)  128         decoder_stage2_conv2[0][0]       
__________________________________________________________________________________________________
decoder_stage2_relu2 (Activatio (None, 64, 160, 32)  0           decoder_stage2_bn2[0][0]         
__________________________________________________________________________________________________
decoder_stage2_conv3 (Conv2D)   (None, 64, 160, 64)  2048        decoder_stage2_relu2[0][0]       
__________________________________________________________________________________________________
decoder_stage2_bn3 (BatchNormal (None, 64, 160, 64)  256         decoder_stage2_conv3[0][0]       
__________________________________________________________________________________________________
decoder_stage2_relu3 (Activatio (None, 64, 160, 64)  0           decoder_stage2_bn3[0][0]         
__________________________________________________________________________________________________
add_11 (Add)                    (None, 64, 160, 64)  0           decoder_stage2_relu3[0][0]       
                                                                 stage2_unit1_relu1[0][0]         
__________________________________________________________________________________________________
decoder_stage3_conv1 (Conv2D)   (None, 64, 160, 16)  1024        add_11[0][0]                     
__________________________________________________________________________________________________
decoder_stage3_bn1 (BatchNormal (None, 64, 160, 16)  64          decoder_stage3_conv1[0][0]       
__________________________________________________________________________________________________
decoder_stage3_relu1 (Activatio (None, 64, 160, 16)  0           decoder_stage3_bn1[0][0]         
__________________________________________________________________________________________________
decoder_stage3_upsample2 (UpSam (None, 128, 320, 16) 0           decoder_stage3_relu1[0][0]       
__________________________________________________________________________________________________
decoder_stage3_conv2 (Conv2D)   (None, 128, 320, 16) 2304        decoder_stage3_upsample2[0][0]   
__________________________________________________________________________________________________
decoder_stage3_bn2 (BatchNormal (None, 128, 320, 16) 64          decoder_stage3_conv2[0][0]       
__________________________________________________________________________________________________
decoder_stage3_relu2 (Activatio (None, 128, 320, 16) 0           decoder_stage3_bn2[0][0]         
__________________________________________________________________________________________________
decoder_stage3_conv3 (Conv2D)   (None, 128, 320, 64) 1024        decoder_stage3_relu2[0][0]       
__________________________________________________________________________________________________
decoder_stage3_bn3 (BatchNormal (None, 128, 320, 64) 256         decoder_stage3_conv3[0][0]       
__________________________________________________________________________________________________
decoder_stage3_relu3 (Activatio (None, 128, 320, 64) 0           decoder_stage3_bn3[0][0]         
__________________________________________________________________________________________________
add_12 (Add)                    (None, 128, 320, 64) 0           decoder_stage3_relu3[0][0]       
                                                                 relu0[0][0]                      
__________________________________________________________________________________________________
decoder_stage4_conv1 (Conv2D)   (None, 128, 320, 16) 1024        add_12[0][0]                     
__________________________________________________________________________________________________
decoder_stage4_bn1 (BatchNormal (None, 128, 320, 16) 64          decoder_stage4_conv1[0][0]       
__________________________________________________________________________________________________
decoder_stage4_relu1 (Activatio (None, 128, 320, 16) 0           decoder_stage4_bn1[0][0]         
__________________________________________________________________________________________________
decoder_stage4_upsample2 (UpSam (None, 256, 640, 16) 0           decoder_stage4_relu1[0][0]       
__________________________________________________________________________________________________
decoder_stage4_conv2 (Conv2D)   (None, 256, 640, 16) 2304        decoder_stage4_upsample2[0][0]   
__________________________________________________________________________________________________
decoder_stage4_bn2 (BatchNormal (None, 256, 640, 16) 64          decoder_stage4_conv2[0][0]       
__________________________________________________________________________________________________
decoder_stage4_relu2 (Activatio (None, 256, 640, 16) 0           decoder_stage4_bn2[0][0]         
__________________________________________________________________________________________________
decoder_stage4_conv3 (Conv2D)   (None, 256, 640, 16) 256         decoder_stage4_relu2[0][0]       
__________________________________________________________________________________________________
decoder_stage4_bn3 (BatchNormal (None, 256, 640, 16) 64          decoder_stage4_conv3[0][0]       
__________________________________________________________________________________________________
decoder_stage4_relu3 (Activatio (None, 256, 640, 16) 0           decoder_stage4_bn3[0][0]         
__________________________________________________________________________________________________
final_conv (Conv2D)             (None, 256, 640, 3)  435         decoder_stage4_relu3[0][0]       
__________________________________________________________________________________________________
softmax (Activation)            (None, 256, 640, 3)  0           final_conv[0][0]                 
==================================================================================================
Total params: 11,521,980
Trainable params: 11,511,958
Non-trainable params: 10,022
__________________________________________________________________________________________________
Optimizer: <keras.optimizers.Adam object at 0x7f4e7eb70668>, learning rate: 0.0001, loss: [<function dice_fp_penalty_loss at 0x7f4faf2e1d90>], metrics: ['categorical_accuracy']

Callbacks: [<keras.callbacks.ReduceLROnPlateau object at 0x7f4faf26e6d8>, <keras.callbacks.EarlyStopping object at 0x7f4faf26e5c0>, <keras.callbacks.TensorBoard object at 0x7f4faf29eb70>, <callbacks.telegram_callback.TelegramCallback object at 0x7f4faf357390>, <keras.callbacks.CSVLogger object at 0x7f4faf26e6a0>, <keras.callbacks.ModelCheckpoint object at 0x7f4faf27b7f0>]

Steps per epoch: 894
Starting training...

Epoch 1/1000
 - 65s - loss: 0.4661 - categorical_accuracy: 0.8577

Epoch 00001: loss improved from inf to 0.46610, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 2/1000
 - 61s - loss: 0.2410 - categorical_accuracy: 0.9346

Epoch 00002: loss improved from 0.46610 to 0.24102, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 3/1000
 - 62s - loss: 0.1653 - categorical_accuracy: 0.9521

Epoch 00003: loss improved from 0.24102 to 0.16530, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 4/1000
 - 61s - loss: 0.1244 - categorical_accuracy: 0.9624

Epoch 00004: loss improved from 0.16530 to 0.12441, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 5/1000
 - 61s - loss: 0.1011 - categorical_accuracy: 0.9694

Epoch 00005: loss improved from 0.12441 to 0.10113, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 6/1000
 - 61s - loss: 0.0805 - categorical_accuracy: 0.9753

Epoch 00006: loss improved from 0.10113 to 0.08050, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 7/1000
 - 61s - loss: 0.0704 - categorical_accuracy: 0.9783

Epoch 00007: loss improved from 0.08050 to 0.07044, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 8/1000
 - 61s - loss: 0.0689 - categorical_accuracy: 0.9787

Epoch 00008: loss improved from 0.07044 to 0.06887, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 9/1000
 - 61s - loss: 0.0522 - categorical_accuracy: 0.9834

Epoch 00009: loss improved from 0.06887 to 0.05222, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 10/1000
 - 60s - loss: 0.0481 - categorical_accuracy: 0.9848

Epoch 00010: loss improved from 0.05222 to 0.04805, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 11/1000
 - 60s - loss: 0.0454 - categorical_accuracy: 0.9857

Epoch 00011: loss improved from 0.04805 to 0.04536, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 12/1000
 - 60s - loss: 0.0425 - categorical_accuracy: 0.9866

Epoch 00012: loss improved from 0.04536 to 0.04251, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 13/1000
 - 60s - loss: 0.0417 - categorical_accuracy: 0.9867

Epoch 00013: loss improved from 0.04251 to 0.04174, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 14/1000
 - 60s - loss: 0.0380 - categorical_accuracy: 0.9879

Epoch 00014: loss improved from 0.04174 to 0.03800, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 15/1000
 - 60s - loss: 0.0367 - categorical_accuracy: 0.9882

Epoch 00015: loss improved from 0.03800 to 0.03673, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 16/1000
 - 60s - loss: 0.0347 - categorical_accuracy: 0.9889

Epoch 00016: loss improved from 0.03673 to 0.03467, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 17/1000
 - 60s - loss: 0.0357 - categorical_accuracy: 0.9886

Epoch 00017: loss did not improve from 0.03467
Epoch 18/1000
 - 60s - loss: 0.0326 - categorical_accuracy: 0.9895

Epoch 00018: loss improved from 0.03467 to 0.03261, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 19/1000
 - 60s - loss: 0.0278 - categorical_accuracy: 0.9909

Epoch 00019: loss improved from 0.03261 to 0.02782, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 20/1000
 - 60s - loss: 0.0276 - categorical_accuracy: 0.9910

Epoch 00020: loss improved from 0.02782 to 0.02765, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 21/1000
 - 60s - loss: 0.0276 - categorical_accuracy: 0.9911

Epoch 00021: loss improved from 0.02765 to 0.02764, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 22/1000
 - 60s - loss: 0.0275 - categorical_accuracy: 0.9911

Epoch 00022: loss improved from 0.02764 to 0.02750, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 23/1000
 - 60s - loss: 0.0280 - categorical_accuracy: 0.9910

Epoch 00023: loss did not improve from 0.02750
Epoch 24/1000
 - 60s - loss: 0.0235 - categorical_accuracy: 0.9923

Epoch 00024: loss improved from 0.02750 to 0.02348, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 25/1000
 - 60s - loss: 0.0207 - categorical_accuracy: 0.9932

Epoch 00025: loss improved from 0.02348 to 0.02069, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 26/1000
 - 60s - loss: 0.0229 - categorical_accuracy: 0.9925

Epoch 00026: loss did not improve from 0.02069
Epoch 27/1000
 - 60s - loss: 0.0231 - categorical_accuracy: 0.9924

Epoch 00027: loss did not improve from 0.02069
Epoch 28/1000
 - 60s - loss: 0.0201 - categorical_accuracy: 0.9934

Epoch 00028: loss improved from 0.02069 to 0.02007, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 29/1000
 - 60s - loss: 0.0223 - categorical_accuracy: 0.9927

Epoch 00029: loss did not improve from 0.02007
Epoch 30/1000
 - 60s - loss: 0.0218 - categorical_accuracy: 0.9929

Epoch 00030: loss did not improve from 0.02007
Epoch 31/1000
 - 60s - loss: 0.0196 - categorical_accuracy: 0.9936

Epoch 00031: loss improved from 0.02007 to 0.01962, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 32/1000
 - 60s - loss: 0.0190 - categorical_accuracy: 0.9938

Epoch 00032: loss improved from 0.01962 to 0.01901, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 33/1000
 - 60s - loss: 0.0195 - categorical_accuracy: 0.9936

Epoch 00033: loss did not improve from 0.01901
Epoch 34/1000
 - 60s - loss: 0.0200 - categorical_accuracy: 0.9934

Epoch 00034: loss did not improve from 0.01901
Epoch 35/1000
 - 60s - loss: 0.0140 - categorical_accuracy: 0.9954

Epoch 00035: loss improved from 0.01901 to 0.01402, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 36/1000
 - 60s - loss: 0.0148 - categorical_accuracy: 0.9951

Epoch 00036: loss did not improve from 0.01402
Epoch 37/1000
 - 60s - loss: 0.0166 - categorical_accuracy: 0.9946

Epoch 00037: loss did not improve from 0.01402
Epoch 38/1000
 - 60s - loss: 0.0168 - categorical_accuracy: 0.9945

Epoch 00038: loss did not improve from 0.01402
Epoch 39/1000
 - 59s - loss: 0.0165 - categorical_accuracy: 0.9946

Epoch 00039: ReduceLROnPlateau reducing learning rate to 4.999999873689376e-05.

Epoch 00039: loss did not improve from 0.01402
Epoch 40/1000
 - 60s - loss: 0.0137 - categorical_accuracy: 0.9955

Epoch 00040: loss improved from 0.01402 to 0.01370, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 41/1000
 - 59s - loss: 0.0089 - categorical_accuracy: 0.9970

Epoch 00041: loss improved from 0.01370 to 0.00890, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 42/1000
 - 59s - loss: 0.0099 - categorical_accuracy: 0.9967

Epoch 00042: loss did not improve from 0.00890
Epoch 43/1000
 - 59s - loss: 0.0106 - categorical_accuracy: 0.9964

Epoch 00043: loss did not improve from 0.00890
Epoch 44/1000
 - 59s - loss: 0.0103 - categorical_accuracy: 0.9965

Epoch 00044: loss did not improve from 0.00890
Epoch 45/1000
 - 59s - loss: 0.0100 - categorical_accuracy: 0.9966

Epoch 00045: ReduceLROnPlateau reducing learning rate to 2.499999936844688e-05.

Epoch 00045: loss did not improve from 0.00890
Epoch 46/1000
 - 60s - loss: 0.0083 - categorical_accuracy: 0.9972

Epoch 00046: loss improved from 0.00890 to 0.00828, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 47/1000
 - 59s - loss: 0.0058 - categorical_accuracy: 0.9980

Epoch 00047: loss improved from 0.00828 to 0.00579, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 48/1000
 - 60s - loss: 0.0060 - categorical_accuracy: 0.9980

Epoch 00048: loss did not improve from 0.00579
Epoch 49/1000
 - 59s - loss: 0.0067 - categorical_accuracy: 0.9977

Epoch 00049: loss did not improve from 0.00579
Epoch 50/1000
 - 59s - loss: 0.0065 - categorical_accuracy: 0.9978

Epoch 00050: loss did not improve from 0.00579
Epoch 51/1000
 - 60s - loss: 0.0066 - categorical_accuracy: 0.9978

Epoch 00051: ReduceLROnPlateau reducing learning rate to 1.249999968422344e-05.

Epoch 00051: loss did not improve from 0.00579
Epoch 52/1000
 - 59s - loss: 0.0064 - categorical_accuracy: 0.9978

Epoch 00052: loss did not improve from 0.00579
Epoch 53/1000
 - 59s - loss: 0.0047 - categorical_accuracy: 0.9984

Epoch 00053: loss improved from 0.00579 to 0.00475, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 54/1000
 - 60s - loss: 0.0045 - categorical_accuracy: 0.9985

Epoch 00054: loss improved from 0.00475 to 0.00445, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 55/1000
 - 59s - loss: 0.0045 - categorical_accuracy: 0.9985

Epoch 00055: loss did not improve from 0.00445
Epoch 56/1000
 - 59s - loss: 0.0047 - categorical_accuracy: 0.9984

Epoch 00056: loss did not improve from 0.00445
Epoch 57/1000
 - 59s - loss: 0.0048 - categorical_accuracy: 0.9984

Epoch 00057: loss did not improve from 0.00445
Epoch 58/1000
 - 60s - loss: 0.0048 - categorical_accuracy: 0.9984

Epoch 00058: ReduceLROnPlateau reducing learning rate to 6.24999984211172e-06.

Epoch 00058: loss did not improve from 0.00445
Epoch 59/1000
 - 59s - loss: 0.0047 - categorical_accuracy: 0.9984

Epoch 00059: loss did not improve from 0.00445
Epoch 60/1000
 - 59s - loss: 0.0039 - categorical_accuracy: 0.9987

Epoch 00060: loss improved from 0.00445 to 0.00387, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 61/1000
 - 60s - loss: 0.0037 - categorical_accuracy: 0.9987

Epoch 00061: loss improved from 0.00387 to 0.00372, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 62/1000
 - 59s - loss: 0.0036 - categorical_accuracy: 0.9988

Epoch 00062: loss improved from 0.00372 to 0.00365, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 63/1000
 - 59s - loss: 0.0036 - categorical_accuracy: 0.9988

Epoch 00063: loss improved from 0.00365 to 0.00364, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 64/1000
 - 60s - loss: 0.0036 - categorical_accuracy: 0.9988

Epoch 00064: loss improved from 0.00364 to 0.00362, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 65/1000
 - 59s - loss: 0.0036 - categorical_accuracy: 0.9988

Epoch 00065: loss improved from 0.00362 to 0.00359, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 66/1000
 - 59s - loss: 0.0035 - categorical_accuracy: 0.9988

Epoch 00066: loss improved from 0.00359 to 0.00351, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 67/1000
 - 60s - loss: 0.0035 - categorical_accuracy: 0.9988

Epoch 00067: loss improved from 0.00351 to 0.00349, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 68/1000
 - 59s - loss: 0.0035 - categorical_accuracy: 0.9988

Epoch 00068: loss improved from 0.00349 to 0.00348, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 69/1000
 - 59s - loss: 0.0035 - categorical_accuracy: 0.9988

Epoch 00069: loss did not improve from 0.00348
Epoch 70/1000
 - 59s - loss: 0.0034 - categorical_accuracy: 0.9988

Epoch 00070: ReduceLROnPlateau reducing learning rate to 3.12499992105586e-06.

Epoch 00070: loss improved from 0.00348 to 0.00345, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 71/1000
 - 59s - loss: 0.0034 - categorical_accuracy: 0.9989

Epoch 00071: loss improved from 0.00345 to 0.00344, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 72/1000
 - 60s - loss: 0.0032 - categorical_accuracy: 0.9989

Epoch 00072: loss improved from 0.00344 to 0.00325, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 73/1000
 - 59s - loss: 0.0032 - categorical_accuracy: 0.9989

Epoch 00073: loss improved from 0.00325 to 0.00318, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 74/1000
 - 59s - loss: 0.0031 - categorical_accuracy: 0.9990

Epoch 00074: loss improved from 0.00318 to 0.00314, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 75/1000
 - 59s - loss: 0.0031 - categorical_accuracy: 0.9990

Epoch 00075: loss improved from 0.00314 to 0.00312, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 76/1000
 - 59s - loss: 0.0031 - categorical_accuracy: 0.9990

Epoch 00076: loss improved from 0.00312 to 0.00309, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 77/1000
 - 60s - loss: 0.0031 - categorical_accuracy: 0.9990

Epoch 00077: loss did not improve from 0.00309
Epoch 78/1000
 - 59s - loss: 0.0030 - categorical_accuracy: 0.9990

Epoch 00078: loss improved from 0.00309 to 0.00304, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 79/1000
 - 59s - loss: 0.0031 - categorical_accuracy: 0.9990

Epoch 00079: loss did not improve from 0.00304
Epoch 80/1000
 - 59s - loss: 0.0030 - categorical_accuracy: 0.9990

Epoch 00080: loss improved from 0.00304 to 0.00303, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 81/1000
 - 59s - loss: 0.0030 - categorical_accuracy: 0.9990
Message did not send. Error: Timed out.

Epoch 00081: loss improved from 0.00303 to 0.00301, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 82/1000
 - 59s - loss: 0.0030 - categorical_accuracy: 0.9990

Epoch 00082: ReduceLROnPlateau reducing learning rate to 1.56249996052793e-06.

Epoch 00082: loss improved from 0.00301 to 0.00300, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 83/1000
 - 59s - loss: 0.0030 - categorical_accuracy: 0.9990

Epoch 00083: loss improved from 0.00300 to 0.00297, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 84/1000
 - 59s - loss: 0.0029 - categorical_accuracy: 0.9990

Epoch 00084: loss improved from 0.00297 to 0.00291, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 85/1000
 - 60s - loss: 0.0029 - categorical_accuracy: 0.9990

Epoch 00085: loss improved from 0.00291 to 0.00290, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 86/1000
 - 59s - loss: 0.0029 - categorical_accuracy: 0.9990

Epoch 00086: loss improved from 0.00290 to 0.00289, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 87/1000
 - 59s - loss: 0.0029 - categorical_accuracy: 0.9990

Epoch 00087: loss did not improve from 0.00289
Epoch 88/1000
 - 60s - loss: 0.0029 - categorical_accuracy: 0.9991

Epoch 00088: ReduceLROnPlateau reducing learning rate to 7.81249980263965e-07.

Epoch 00088: loss improved from 0.00289 to 0.00288, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 89/1000
 - 59s - loss: 0.0029 - categorical_accuracy: 0.9991

Epoch 00089: loss improved from 0.00288 to 0.00287, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 90/1000
 - 59s - loss: 0.0029 - categorical_accuracy: 0.9991

Epoch 00090: loss improved from 0.00287 to 0.00285, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 91/1000
 - 60s - loss: 0.0028 - categorical_accuracy: 0.9991

Epoch 00091: loss improved from 0.00285 to 0.00284, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 92/1000
 - 59s - loss: 0.0028 - categorical_accuracy: 0.9991

Epoch 00092: ReduceLROnPlateau reducing learning rate to 3.906249901319825e-07.

Epoch 00092: loss improved from 0.00284 to 0.00283, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 93/1000
 - 59s - loss: 0.0028 - categorical_accuracy: 0.9991

Epoch 00093: loss improved from 0.00283 to 0.00283, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 94/1000
 - 59s - loss: 0.0029 - categorical_accuracy: 0.9991

Epoch 00094: loss did not improve from 0.00283
Epoch 95/1000
 - 59s - loss: 0.0028 - categorical_accuracy: 0.9991

Epoch 00095: loss did not improve from 0.00283
Epoch 96/1000
 - 60s - loss: 0.0028 - categorical_accuracy: 0.9991

Epoch 00096: ReduceLROnPlateau reducing learning rate to 1.9531249506599124e-07.

Epoch 00096: loss did not improve from 0.00283
Epoch 97/1000
 - 59s - loss: 0.0028 - categorical_accuracy: 0.9991

Epoch 00097: loss improved from 0.00283 to 0.00282, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 98/1000
 - 59s - loss: 0.0028 - categorical_accuracy: 0.9991

Epoch 00098: loss improved from 0.00282 to 0.00282, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 99/1000
 - 59s - loss: 0.0028 - categorical_accuracy: 0.9991

Epoch 00099: loss improved from 0.00282 to 0.00282, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 100/1000
 - 59s - loss: 0.0028 - categorical_accuracy: 0.9991

Epoch 00100: loss improved from 0.00282 to 0.00280, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 101/1000
 - 59s - loss: 0.0028 - categorical_accuracy: 0.9991

Epoch 00101: loss improved from 0.00280 to 0.00278, saving model to weights/segmentation/2019-03-30 11-24-56.hdf5
Epoch 102/1000
 - 60s - loss: 0.0028 - categorical_accuracy: 0.9991

Epoch 00102: loss did not improve from 0.00278
Epoch 103/1000
 - 59s - loss: 0.0028 - categorical_accuracy: 0.9991

Epoch 00103: loss did not improve from 0.00278
Epoch 104/1000
 - 60s - loss: 0.0028 - categorical_accuracy: 0.9991

Epoch 00104: ReduceLROnPlateau reducing learning rate to 1e-07.

Epoch 00104: loss did not improve from 0.00278
Epoch 105/1000
 - 60s - loss: 0.0028 - categorical_accuracy: 0.9991

Epoch 00105: loss did not improve from 0.00278
Epoch 106/1000
 - 59s - loss: 0.0028 - categorical_accuracy: 0.9991

Epoch 00106: loss did not improve from 0.00278
Epoch 107/1000
 - 59s - loss: 0.0028 - categorical_accuracy: 0.9991

Epoch 00107: loss did not improve from 0.00278
Epoch 108/1000
 - 59s - loss: 0.0028 - categorical_accuracy: 0.9991

Epoch 00108: ReduceLROnPlateau reducing learning rate to 1e-07.

Epoch 00108: loss did not improve from 0.00278
Epoch 109/1000
 - 60s - loss: 0.0028 - categorical_accuracy: 0.9991

Epoch 00109: loss did not improve from 0.00278
Epoch 110/1000
 - 59s - loss: 0.0028 - categorical_accuracy: 0.9991

Epoch 00110: loss did not improve from 0.00278
Epoch 111/1000
 - 60s - loss: 0.0028 - categorical_accuracy: 0.9991

Epoch 00111: loss did not improve from 0.00278
Epoch 00111: early stopping
Finished training

Date and time: 2019-03-30 13-16-06

