Date and time: 2019-03-27 13-59-56

Datasets used: ['/home/vostankovich/CycleGANToD/results/day2night_inno_cyclegan/test_latest/images']

894
447
DOING AUGMENTATION
DOING GAN
Model summary:
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
data (InputLayer)               (None, 256, 640, 3)  0                                            
__________________________________________________________________________________________________
bn_data (BatchNormalization)    (None, 256, 640, 3)  9           data[0][0]                       
__________________________________________________________________________________________________
zero_padding2d_1 (ZeroPadding2D (None, 262, 646, 3)  0           bn_data[0][0]                    
__________________________________________________________________________________________________
conv0 (Conv2D)                  (None, 128, 320, 64) 9408        zero_padding2d_1[0][0]           
__________________________________________________________________________________________________
bn0 (BatchNormalization)        (None, 128, 320, 64) 256         conv0[0][0]                      
__________________________________________________________________________________________________
relu0 (Activation)              (None, 128, 320, 64) 0           bn0[0][0]                        
__________________________________________________________________________________________________
zero_padding2d_2 (ZeroPadding2D (None, 130, 322, 64) 0           relu0[0][0]                      
__________________________________________________________________________________________________
pooling0 (MaxPooling2D)         (None, 64, 160, 64)  0           zero_padding2d_2[0][0]           
__________________________________________________________________________________________________
stage1_unit1_bn1 (BatchNormaliz (None, 64, 160, 64)  256         pooling0[0][0]                   
__________________________________________________________________________________________________
stage1_unit1_relu1 (Activation) (None, 64, 160, 64)  0           stage1_unit1_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_3 (ZeroPadding2D (None, 66, 162, 64)  0           stage1_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage1_unit1_conv1 (Conv2D)     (None, 64, 160, 64)  36864       zero_padding2d_3[0][0]           
__________________________________________________________________________________________________
stage1_unit1_bn2 (BatchNormaliz (None, 64, 160, 64)  256         stage1_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage1_unit1_relu2 (Activation) (None, 64, 160, 64)  0           stage1_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_4 (ZeroPadding2D (None, 66, 162, 64)  0           stage1_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage1_unit1_conv2 (Conv2D)     (None, 64, 160, 64)  36864       zero_padding2d_4[0][0]           
__________________________________________________________________________________________________
stage1_unit1_sc (Conv2D)        (None, 64, 160, 64)  4096        stage1_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_1 (Add)                     (None, 64, 160, 64)  0           stage1_unit1_conv2[0][0]         
                                                                 stage1_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage1_unit2_bn1 (BatchNormaliz (None, 64, 160, 64)  256         add_1[0][0]                      
__________________________________________________________________________________________________
stage1_unit2_relu1 (Activation) (None, 64, 160, 64)  0           stage1_unit2_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_5 (ZeroPadding2D (None, 66, 162, 64)  0           stage1_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage1_unit2_conv1 (Conv2D)     (None, 64, 160, 64)  36864       zero_padding2d_5[0][0]           
__________________________________________________________________________________________________
stage1_unit2_bn2 (BatchNormaliz (None, 64, 160, 64)  256         stage1_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage1_unit2_relu2 (Activation) (None, 64, 160, 64)  0           stage1_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_6 (ZeroPadding2D (None, 66, 162, 64)  0           stage1_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage1_unit2_conv2 (Conv2D)     (None, 64, 160, 64)  36864       zero_padding2d_6[0][0]           
__________________________________________________________________________________________________
add_2 (Add)                     (None, 64, 160, 64)  0           stage1_unit2_conv2[0][0]         
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
stage2_unit1_bn1 (BatchNormaliz (None, 64, 160, 64)  256         add_2[0][0]                      
__________________________________________________________________________________________________
stage2_unit1_relu1 (Activation) (None, 64, 160, 64)  0           stage2_unit1_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_7 (ZeroPadding2D (None, 66, 162, 64)  0           stage2_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage2_unit1_conv1 (Conv2D)     (None, 32, 80, 128)  73728       zero_padding2d_7[0][0]           
__________________________________________________________________________________________________
stage2_unit1_bn2 (BatchNormaliz (None, 32, 80, 128)  512         stage2_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage2_unit1_relu2 (Activation) (None, 32, 80, 128)  0           stage2_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_8 (ZeroPadding2D (None, 34, 82, 128)  0           stage2_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage2_unit1_conv2 (Conv2D)     (None, 32, 80, 128)  147456      zero_padding2d_8[0][0]           
__________________________________________________________________________________________________
stage2_unit1_sc (Conv2D)        (None, 32, 80, 128)  8192        stage2_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_3 (Add)                     (None, 32, 80, 128)  0           stage2_unit1_conv2[0][0]         
                                                                 stage2_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage2_unit2_bn1 (BatchNormaliz (None, 32, 80, 128)  512         add_3[0][0]                      
__________________________________________________________________________________________________
stage2_unit2_relu1 (Activation) (None, 32, 80, 128)  0           stage2_unit2_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_9 (ZeroPadding2D (None, 34, 82, 128)  0           stage2_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage2_unit2_conv1 (Conv2D)     (None, 32, 80, 128)  147456      zero_padding2d_9[0][0]           
__________________________________________________________________________________________________
stage2_unit2_bn2 (BatchNormaliz (None, 32, 80, 128)  512         stage2_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage2_unit2_relu2 (Activation) (None, 32, 80, 128)  0           stage2_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_10 (ZeroPadding2 (None, 34, 82, 128)  0           stage2_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage2_unit2_conv2 (Conv2D)     (None, 32, 80, 128)  147456      zero_padding2d_10[0][0]          
__________________________________________________________________________________________________
add_4 (Add)                     (None, 32, 80, 128)  0           stage2_unit2_conv2[0][0]         
                                                                 add_3[0][0]                      
__________________________________________________________________________________________________
stage3_unit1_bn1 (BatchNormaliz (None, 32, 80, 128)  512         add_4[0][0]                      
__________________________________________________________________________________________________
stage3_unit1_relu1 (Activation) (None, 32, 80, 128)  0           stage3_unit1_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_11 (ZeroPadding2 (None, 34, 82, 128)  0           stage3_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage3_unit1_conv1 (Conv2D)     (None, 16, 40, 256)  294912      zero_padding2d_11[0][0]          
__________________________________________________________________________________________________
stage3_unit1_bn2 (BatchNormaliz (None, 16, 40, 256)  1024        stage3_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage3_unit1_relu2 (Activation) (None, 16, 40, 256)  0           stage3_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_12 (ZeroPadding2 (None, 18, 42, 256)  0           stage3_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage3_unit1_conv2 (Conv2D)     (None, 16, 40, 256)  589824      zero_padding2d_12[0][0]          
__________________________________________________________________________________________________
stage3_unit1_sc (Conv2D)        (None, 16, 40, 256)  32768       stage3_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_5 (Add)                     (None, 16, 40, 256)  0           stage3_unit1_conv2[0][0]         
                                                                 stage3_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage3_unit2_bn1 (BatchNormaliz (None, 16, 40, 256)  1024        add_5[0][0]                      
__________________________________________________________________________________________________
stage3_unit2_relu1 (Activation) (None, 16, 40, 256)  0           stage3_unit2_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_13 (ZeroPadding2 (None, 18, 42, 256)  0           stage3_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage3_unit2_conv1 (Conv2D)     (None, 16, 40, 256)  589824      zero_padding2d_13[0][0]          
__________________________________________________________________________________________________
stage3_unit2_bn2 (BatchNormaliz (None, 16, 40, 256)  1024        stage3_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage3_unit2_relu2 (Activation) (None, 16, 40, 256)  0           stage3_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_14 (ZeroPadding2 (None, 18, 42, 256)  0           stage3_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage3_unit2_conv2 (Conv2D)     (None, 16, 40, 256)  589824      zero_padding2d_14[0][0]          
__________________________________________________________________________________________________
add_6 (Add)                     (None, 16, 40, 256)  0           stage3_unit2_conv2[0][0]         
                                                                 add_5[0][0]                      
__________________________________________________________________________________________________
stage4_unit1_bn1 (BatchNormaliz (None, 16, 40, 256)  1024        add_6[0][0]                      
__________________________________________________________________________________________________
stage4_unit1_relu1 (Activation) (None, 16, 40, 256)  0           stage4_unit1_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_15 (ZeroPadding2 (None, 18, 42, 256)  0           stage4_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage4_unit1_conv1 (Conv2D)     (None, 8, 20, 512)   1179648     zero_padding2d_15[0][0]          
__________________________________________________________________________________________________
stage4_unit1_bn2 (BatchNormaliz (None, 8, 20, 512)   2048        stage4_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage4_unit1_relu2 (Activation) (None, 8, 20, 512)   0           stage4_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_16 (ZeroPadding2 (None, 10, 22, 512)  0           stage4_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage4_unit1_conv2 (Conv2D)     (None, 8, 20, 512)   2359296     zero_padding2d_16[0][0]          
__________________________________________________________________________________________________
stage4_unit1_sc (Conv2D)        (None, 8, 20, 512)   131072      stage4_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_7 (Add)                     (None, 8, 20, 512)   0           stage4_unit1_conv2[0][0]         
                                                                 stage4_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage4_unit2_bn1 (BatchNormaliz (None, 8, 20, 512)   2048        add_7[0][0]                      
__________________________________________________________________________________________________
stage4_unit2_relu1 (Activation) (None, 8, 20, 512)   0           stage4_unit2_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_17 (ZeroPadding2 (None, 10, 22, 512)  0           stage4_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage4_unit2_conv1 (Conv2D)     (None, 8, 20, 512)   2359296     zero_padding2d_17[0][0]          
__________________________________________________________________________________________________
stage4_unit2_bn2 (BatchNormaliz (None, 8, 20, 512)   2048        stage4_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage4_unit2_relu2 (Activation) (None, 8, 20, 512)   0           stage4_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_18 (ZeroPadding2 (None, 10, 22, 512)  0           stage4_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage4_unit2_conv2 (Conv2D)     (None, 8, 20, 512)   2359296     zero_padding2d_18[0][0]          
__________________________________________________________________________________________________
add_8 (Add)                     (None, 8, 20, 512)   0           stage4_unit2_conv2[0][0]         
                                                                 add_7[0][0]                      
__________________________________________________________________________________________________
bn1 (BatchNormalization)        (None, 8, 20, 512)   2048        add_8[0][0]                      
__________________________________________________________________________________________________
relu1 (Activation)              (None, 8, 20, 512)   0           bn1[0][0]                        
__________________________________________________________________________________________________
decoder_stage0_conv1 (Conv2D)   (None, 8, 20, 128)   65536       relu1[0][0]                      
__________________________________________________________________________________________________
decoder_stage0_bn1 (BatchNormal (None, 8, 20, 128)   512         decoder_stage0_conv1[0][0]       
__________________________________________________________________________________________________
decoder_stage0_relu1 (Activatio (None, 8, 20, 128)   0           decoder_stage0_bn1[0][0]         
__________________________________________________________________________________________________
decoder_stage0_upsample2 (UpSam (None, 16, 40, 128)  0           decoder_stage0_relu1[0][0]       
__________________________________________________________________________________________________
decoder_stage0_conv2 (Conv2D)   (None, 16, 40, 128)  147456      decoder_stage0_upsample2[0][0]   
__________________________________________________________________________________________________
decoder_stage0_bn2 (BatchNormal (None, 16, 40, 128)  512         decoder_stage0_conv2[0][0]       
__________________________________________________________________________________________________
decoder_stage0_relu2 (Activatio (None, 16, 40, 128)  0           decoder_stage0_bn2[0][0]         
__________________________________________________________________________________________________
decoder_stage0_conv3 (Conv2D)   (None, 16, 40, 256)  32768       decoder_stage0_relu2[0][0]       
__________________________________________________________________________________________________
decoder_stage0_bn3 (BatchNormal (None, 16, 40, 256)  1024        decoder_stage0_conv3[0][0]       
__________________________________________________________________________________________________
decoder_stage0_relu3 (Activatio (None, 16, 40, 256)  0           decoder_stage0_bn3[0][0]         
__________________________________________________________________________________________________
add_9 (Add)                     (None, 16, 40, 256)  0           decoder_stage0_relu3[0][0]       
                                                                 stage4_unit1_relu1[0][0]         
__________________________________________________________________________________________________
decoder_stage1_conv1 (Conv2D)   (None, 16, 40, 64)   16384       add_9[0][0]                      
__________________________________________________________________________________________________
decoder_stage1_bn1 (BatchNormal (None, 16, 40, 64)   256         decoder_stage1_conv1[0][0]       
__________________________________________________________________________________________________
decoder_stage1_relu1 (Activatio (None, 16, 40, 64)   0           decoder_stage1_bn1[0][0]         
__________________________________________________________________________________________________
decoder_stage1_upsample2 (UpSam (None, 32, 80, 64)   0           decoder_stage1_relu1[0][0]       
__________________________________________________________________________________________________
decoder_stage1_conv2 (Conv2D)   (None, 32, 80, 64)   36864       decoder_stage1_upsample2[0][0]   
__________________________________________________________________________________________________
decoder_stage1_bn2 (BatchNormal (None, 32, 80, 64)   256         decoder_stage1_conv2[0][0]       
__________________________________________________________________________________________________
decoder_stage1_relu2 (Activatio (None, 32, 80, 64)   0           decoder_stage1_bn2[0][0]         
__________________________________________________________________________________________________
decoder_stage1_conv3 (Conv2D)   (None, 32, 80, 128)  8192        decoder_stage1_relu2[0][0]       
__________________________________________________________________________________________________
decoder_stage1_bn3 (BatchNormal (None, 32, 80, 128)  512         decoder_stage1_conv3[0][0]       
__________________________________________________________________________________________________
decoder_stage1_relu3 (Activatio (None, 32, 80, 128)  0           decoder_stage1_bn3[0][0]         
__________________________________________________________________________________________________
add_10 (Add)                    (None, 32, 80, 128)  0           decoder_stage1_relu3[0][0]       
                                                                 stage3_unit1_relu1[0][0]         
__________________________________________________________________________________________________
decoder_stage2_conv1 (Conv2D)   (None, 32, 80, 32)   4096        add_10[0][0]                     
__________________________________________________________________________________________________
decoder_stage2_bn1 (BatchNormal (None, 32, 80, 32)   128         decoder_stage2_conv1[0][0]       
__________________________________________________________________________________________________
decoder_stage2_relu1 (Activatio (None, 32, 80, 32)   0           decoder_stage2_bn1[0][0]         
__________________________________________________________________________________________________
decoder_stage2_upsample2 (UpSam (None, 64, 160, 32)  0           decoder_stage2_relu1[0][0]       
__________________________________________________________________________________________________
decoder_stage2_conv2 (Conv2D)   (None, 64, 160, 32)  9216        decoder_stage2_upsample2[0][0]   
__________________________________________________________________________________________________
decoder_stage2_bn2 (BatchNormal (None, 64, 160, 32)  128         decoder_stage2_conv2[0][0]       
__________________________________________________________________________________________________
decoder_stage2_relu2 (Activatio (None, 64, 160, 32)  0           decoder_stage2_bn2[0][0]         
__________________________________________________________________________________________________
decoder_stage2_conv3 (Conv2D)   (None, 64, 160, 64)  2048        decoder_stage2_relu2[0][0]       
__________________________________________________________________________________________________
decoder_stage2_bn3 (BatchNormal (None, 64, 160, 64)  256         decoder_stage2_conv3[0][0]       
__________________________________________________________________________________________________
decoder_stage2_relu3 (Activatio (None, 64, 160, 64)  0           decoder_stage2_bn3[0][0]         
__________________________________________________________________________________________________
add_11 (Add)                    (None, 64, 160, 64)  0           decoder_stage2_relu3[0][0]       
                                                                 stage2_unit1_relu1[0][0]         
__________________________________________________________________________________________________
decoder_stage3_conv1 (Conv2D)   (None, 64, 160, 16)  1024        add_11[0][0]                     
__________________________________________________________________________________________________
decoder_stage3_bn1 (BatchNormal (None, 64, 160, 16)  64          decoder_stage3_conv1[0][0]       
__________________________________________________________________________________________________
decoder_stage3_relu1 (Activatio (None, 64, 160, 16)  0           decoder_stage3_bn1[0][0]         
__________________________________________________________________________________________________
decoder_stage3_upsample2 (UpSam (None, 128, 320, 16) 0           decoder_stage3_relu1[0][0]       
__________________________________________________________________________________________________
decoder_stage3_conv2 (Conv2D)   (None, 128, 320, 16) 2304        decoder_stage3_upsample2[0][0]   
__________________________________________________________________________________________________
decoder_stage3_bn2 (BatchNormal (None, 128, 320, 16) 64          decoder_stage3_conv2[0][0]       
__________________________________________________________________________________________________
decoder_stage3_relu2 (Activatio (None, 128, 320, 16) 0           decoder_stage3_bn2[0][0]         
__________________________________________________________________________________________________
decoder_stage3_conv3 (Conv2D)   (None, 128, 320, 64) 1024        decoder_stage3_relu2[0][0]       
__________________________________________________________________________________________________
decoder_stage3_bn3 (BatchNormal (None, 128, 320, 64) 256         decoder_stage3_conv3[0][0]       
__________________________________________________________________________________________________
decoder_stage3_relu3 (Activatio (None, 128, 320, 64) 0           decoder_stage3_bn3[0][0]         
__________________________________________________________________________________________________
add_12 (Add)                    (None, 128, 320, 64) 0           decoder_stage3_relu3[0][0]       
                                                                 relu0[0][0]                      
__________________________________________________________________________________________________
decoder_stage4_conv1 (Conv2D)   (None, 128, 320, 16) 1024        add_12[0][0]                     
__________________________________________________________________________________________________
decoder_stage4_bn1 (BatchNormal (None, 128, 320, 16) 64          decoder_stage4_conv1[0][0]       
__________________________________________________________________________________________________
decoder_stage4_relu1 (Activatio (None, 128, 320, 16) 0           decoder_stage4_bn1[0][0]         
__________________________________________________________________________________________________
decoder_stage4_upsample2 (UpSam (None, 256, 640, 16) 0           decoder_stage4_relu1[0][0]       
__________________________________________________________________________________________________
decoder_stage4_conv2 (Conv2D)   (None, 256, 640, 16) 2304        decoder_stage4_upsample2[0][0]   
__________________________________________________________________________________________________
decoder_stage4_bn2 (BatchNormal (None, 256, 640, 16) 64          decoder_stage4_conv2[0][0]       
__________________________________________________________________________________________________
decoder_stage4_relu2 (Activatio (None, 256, 640, 16) 0           decoder_stage4_bn2[0][0]         
__________________________________________________________________________________________________
decoder_stage4_conv3 (Conv2D)   (None, 256, 640, 16) 256         decoder_stage4_relu2[0][0]       
__________________________________________________________________________________________________
decoder_stage4_bn3 (BatchNormal (None, 256, 640, 16) 64          decoder_stage4_conv3[0][0]       
__________________________________________________________________________________________________
decoder_stage4_relu3 (Activatio (None, 256, 640, 16) 0           decoder_stage4_bn3[0][0]         
__________________________________________________________________________________________________
final_conv (Conv2D)             (None, 256, 640, 3)  435         decoder_stage4_relu3[0][0]       
__________________________________________________________________________________________________
softmax (Activation)            (None, 256, 640, 3)  0           final_conv[0][0]                 
==================================================================================================
Total params: 11,521,980
Trainable params: 11,511,958
Non-trainable params: 10,022
__________________________________________________________________________________________________
Optimizer: <keras.optimizers.Adam object at 0x7fcf843b0f98>, learning rate: 0.0001, loss: [<function jaccard_distance at 0x7fd0d9390c80>], metrics: ['categorical_accuracy']

Callbacks: [<keras.callbacks.ReduceLROnPlateau object at 0x7fd0d9466160>, <keras.callbacks.EarlyStopping object at 0x7fd0d93d8c50>, <keras.callbacks.CSVLogger object at 0x7fd0d93d8f60>, <keras.callbacks.ModelCheckpoint object at 0x7fd0d93e9ba8>]

Steps per epoch: 894
Starting training...

Epoch 1/1000
 - 74s - loss: 0.4088 - categorical_accuracy: 0.8218

Epoch 00001: loss improved from inf to 0.40881, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 2/1000
 - 63s - loss: 0.1391 - categorical_accuracy: 0.9403

Epoch 00002: loss improved from 0.40881 to 0.13910, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 3/1000
 - 64s - loss: 0.0871 - categorical_accuracy: 0.9579

Epoch 00003: loss improved from 0.13910 to 0.08711, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 4/1000
 - 64s - loss: 0.0636 - categorical_accuracy: 0.9686

Epoch 00004: loss improved from 0.08711 to 0.06364, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 5/1000
 - 63s - loss: 0.0494 - categorical_accuracy: 0.9754

Epoch 00005: loss improved from 0.06364 to 0.04938, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 6/1000
 - 62s - loss: 0.0404 - categorical_accuracy: 0.9798

Epoch 00006: loss improved from 0.04938 to 0.04040, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 7/1000
 - 63s - loss: 0.0372 - categorical_accuracy: 0.9813

Epoch 00007: loss improved from 0.04040 to 0.03719, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 8/1000
 - 62s - loss: 0.0328 - categorical_accuracy: 0.9834

Epoch 00008: loss improved from 0.03719 to 0.03282, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 9/1000
 - 63s - loss: 0.0299 - categorical_accuracy: 0.9849

Epoch 00009: loss improved from 0.03282 to 0.02986, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 10/1000
 - 62s - loss: 0.0272 - categorical_accuracy: 0.9862

Epoch 00010: loss improved from 0.02986 to 0.02715, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 11/1000
 - 63s - loss: 0.0250 - categorical_accuracy: 0.9873

Epoch 00011: loss improved from 0.02715 to 0.02502, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 12/1000
 - 62s - loss: 0.0233 - categorical_accuracy: 0.9882

Epoch 00012: loss improved from 0.02502 to 0.02329, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 13/1000
 - 63s - loss: 0.0223 - categorical_accuracy: 0.9887

Epoch 00013: loss improved from 0.02329 to 0.02228, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 14/1000
 - 64s - loss: 0.0225 - categorical_accuracy: 0.9886

Epoch 00014: loss did not improve from 0.02228
Epoch 15/1000
 - 63s - loss: 0.0186 - categorical_accuracy: 0.9906

Epoch 00015: loss improved from 0.02228 to 0.01857, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 16/1000
 - 64s - loss: 0.0177 - categorical_accuracy: 0.9910

Epoch 00016: loss improved from 0.01857 to 0.01772, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 17/1000
 - 63s - loss: 0.0179 - categorical_accuracy: 0.9909

Epoch 00017: loss did not improve from 0.01772
Epoch 18/1000
 - 64s - loss: 0.0180 - categorical_accuracy: 0.9908

Epoch 00018: loss did not improve from 0.01772
Epoch 19/1000
 - 64s - loss: 0.0157 - categorical_accuracy: 0.9920

Epoch 00019: loss improved from 0.01772 to 0.01570, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 20/1000
 - 64s - loss: 0.0161 - categorical_accuracy: 0.9918

Epoch 00020: loss did not improve from 0.01570
Epoch 21/1000
 - 64s - loss: 0.0153 - categorical_accuracy: 0.9922

Epoch 00021: loss improved from 0.01570 to 0.01528, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 22/1000
 - 64s - loss: 0.0138 - categorical_accuracy: 0.9930

Epoch 00022: loss improved from 0.01528 to 0.01380, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 23/1000
 - 64s - loss: 0.0132 - categorical_accuracy: 0.9933

Epoch 00023: loss improved from 0.01380 to 0.01318, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 24/1000
 - 64s - loss: 0.0137 - categorical_accuracy: 0.9930

Epoch 00024: loss did not improve from 0.01318
Epoch 25/1000
 - 64s - loss: 0.0153 - categorical_accuracy: 0.9922

Epoch 00025: loss did not improve from 0.01318
Epoch 26/1000
 - 64s - loss: 0.0149 - categorical_accuracy: 0.9924

Epoch 00026: loss did not improve from 0.01318
Epoch 27/1000
 - 64s - loss: 0.0102 - categorical_accuracy: 0.9948

Epoch 00027: loss improved from 0.01318 to 0.01016, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 28/1000
 - 64s - loss: 0.0110 - categorical_accuracy: 0.9944

Epoch 00028: loss did not improve from 0.01016
Epoch 29/1000
 - 64s - loss: 0.0118 - categorical_accuracy: 0.9940

Epoch 00029: loss did not improve from 0.01016
Epoch 30/1000
 - 65s - loss: 0.0127 - categorical_accuracy: 0.9935

Epoch 00030: loss did not improve from 0.01016
Epoch 31/1000
 - 64s - loss: 0.0115 - categorical_accuracy: 0.9942

Epoch 00031: ReduceLROnPlateau reducing learning rate to 4.999999873689376e-05.

Epoch 00031: loss did not improve from 0.01016
Epoch 32/1000
 - 62s - loss: 0.0087 - categorical_accuracy: 0.9956

Epoch 00032: loss improved from 0.01016 to 0.00868, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 33/1000
 - 62s - loss: 0.0063 - categorical_accuracy: 0.9968

Epoch 00033: loss improved from 0.00868 to 0.00632, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 34/1000
 - 62s - loss: 0.0073 - categorical_accuracy: 0.9963

Epoch 00034: loss did not improve from 0.00632
Epoch 35/1000
 - 62s - loss: 0.0078 - categorical_accuracy: 0.9961

Epoch 00035: loss did not improve from 0.00632
Epoch 36/1000
 - 62s - loss: 0.0073 - categorical_accuracy: 0.9963

Epoch 00036: loss did not improve from 0.00632
Epoch 37/1000
 - 62s - loss: 0.0072 - categorical_accuracy: 0.9963

Epoch 00037: ReduceLROnPlateau reducing learning rate to 2.499999936844688e-05.

Epoch 00037: loss did not improve from 0.00632
Epoch 38/1000
 - 62s - loss: 0.0065 - categorical_accuracy: 0.9967

Epoch 00038: loss did not improve from 0.00632
Epoch 39/1000
 - 63s - loss: 0.0043 - categorical_accuracy: 0.9978

Epoch 00039: loss improved from 0.00632 to 0.00430, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 40/1000
 - 62s - loss: 0.0044 - categorical_accuracy: 0.9978

Epoch 00040: loss did not improve from 0.00430
Epoch 41/1000
 - 62s - loss: 0.0047 - categorical_accuracy: 0.9976

Epoch 00041: loss did not improve from 0.00430
Epoch 42/1000
 - 63s - loss: 0.0047 - categorical_accuracy: 0.9976

Epoch 00042: loss did not improve from 0.00430
Epoch 43/1000
 - 63s - loss: 0.0046 - categorical_accuracy: 0.9977

Epoch 00043: ReduceLROnPlateau reducing learning rate to 1.249999968422344e-05.

Epoch 00043: loss did not improve from 0.00430
Epoch 44/1000
 - 63s - loss: 0.0043 - categorical_accuracy: 0.9978

Epoch 00044: loss improved from 0.00430 to 0.00428, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 45/1000
 - 63s - loss: 0.0032 - categorical_accuracy: 0.9984

Epoch 00045: loss improved from 0.00428 to 0.00318, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 46/1000
 - 63s - loss: 0.0031 - categorical_accuracy: 0.9985

Epoch 00046: loss improved from 0.00318 to 0.00307, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 47/1000
 - 63s - loss: 0.0031 - categorical_accuracy: 0.9984

Epoch 00047: loss did not improve from 0.00307
Epoch 48/1000
 - 62s - loss: 0.0031 - categorical_accuracy: 0.9984

Epoch 00048: loss did not improve from 0.00307
Epoch 49/1000
 - 62s - loss: 0.0032 - categorical_accuracy: 0.9984

Epoch 00049: loss did not improve from 0.00307
Epoch 50/1000
 - 62s - loss: 0.0032 - categorical_accuracy: 0.9984

Epoch 00050: ReduceLROnPlateau reducing learning rate to 6.24999984211172e-06.

Epoch 00050: loss did not improve from 0.00307
Epoch 51/1000
 - 62s - loss: 0.0031 - categorical_accuracy: 0.9985

Epoch 00051: loss improved from 0.00307 to 0.00306, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 52/1000
 - 62s - loss: 0.0026 - categorical_accuracy: 0.9987

Epoch 00052: loss improved from 0.00306 to 0.00260, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 53/1000
 - 62s - loss: 0.0025 - categorical_accuracy: 0.9988

Epoch 00053: loss improved from 0.00260 to 0.00252, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 54/1000
 - 62s - loss: 0.0025 - categorical_accuracy: 0.9988

Epoch 00054: loss improved from 0.00252 to 0.00251, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 55/1000
 - 62s - loss: 0.0025 - categorical_accuracy: 0.9988

Epoch 00055: loss improved from 0.00251 to 0.00247, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 56/1000
 - 62s - loss: 0.0024 - categorical_accuracy: 0.9988

Epoch 00056: loss improved from 0.00247 to 0.00244, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 57/1000
 - 62s - loss: 0.0024 - categorical_accuracy: 0.9988

Epoch 00057: loss improved from 0.00244 to 0.00243, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 58/1000
 - 63s - loss: 0.0024 - categorical_accuracy: 0.9988

Epoch 00058: loss improved from 0.00243 to 0.00239, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 59/1000
 - 63s - loss: 0.0024 - categorical_accuracy: 0.9988

Epoch 00059: ReduceLROnPlateau reducing learning rate to 3.12499992105586e-06.

Epoch 00059: loss did not improve from 0.00239
Epoch 60/1000
 - 63s - loss: 0.0024 - categorical_accuracy: 0.9988

Epoch 00060: loss improved from 0.00239 to 0.00237, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 61/1000
 - 63s - loss: 0.0023 - categorical_accuracy: 0.9989

Epoch 00061: loss improved from 0.00237 to 0.00225, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 62/1000
 - 63s - loss: 0.0022 - categorical_accuracy: 0.9989

Epoch 00062: loss improved from 0.00225 to 0.00220, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 63/1000
 - 63s - loss: 0.0022 - categorical_accuracy: 0.9989

Epoch 00063: loss did not improve from 0.00220
Epoch 64/1000
 - 63s - loss: 0.0022 - categorical_accuracy: 0.9989

Epoch 00064: loss improved from 0.00220 to 0.00219, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 65/1000
 - 63s - loss: 0.0022 - categorical_accuracy: 0.9989

Epoch 00065: ReduceLROnPlateau reducing learning rate to 1.56249996052793e-06.

Epoch 00065: loss improved from 0.00219 to 0.00216, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 66/1000
 - 63s - loss: 0.0021 - categorical_accuracy: 0.9990

Epoch 00066: loss improved from 0.00216 to 0.00214, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 67/1000
 - 63s - loss: 0.0021 - categorical_accuracy: 0.9990

Epoch 00067: loss improved from 0.00214 to 0.00209, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 68/1000
 - 63s - loss: 0.0021 - categorical_accuracy: 0.9990

Epoch 00068: loss did not improve from 0.00209
Epoch 69/1000
 - 63s - loss: 0.0021 - categorical_accuracy: 0.9990

Epoch 00069: loss did not improve from 0.00209
Epoch 70/1000
 - 63s - loss: 0.0021 - categorical_accuracy: 0.9990

Epoch 00070: ReduceLROnPlateau reducing learning rate to 7.81249980263965e-07.

Epoch 00070: loss improved from 0.00209 to 0.00207, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 71/1000
 - 63s - loss: 0.0021 - categorical_accuracy: 0.9990

Epoch 00071: loss improved from 0.00207 to 0.00206, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 72/1000
 - 63s - loss: 0.0021 - categorical_accuracy: 0.9990

Epoch 00072: loss improved from 0.00206 to 0.00206, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 73/1000
 - 63s - loss: 0.0021 - categorical_accuracy: 0.9990

Epoch 00073: loss improved from 0.00206 to 0.00206, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 74/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00074: ReduceLROnPlateau reducing learning rate to 3.906249901319825e-07.

Epoch 00074: loss improved from 0.00206 to 0.00204, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 75/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00075: loss improved from 0.00204 to 0.00203, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 76/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00076: loss did not improve from 0.00203
Epoch 77/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00077: loss did not improve from 0.00203
Epoch 78/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00078: loss did not improve from 0.00203
Epoch 79/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00079: ReduceLROnPlateau reducing learning rate to 1.9531249506599124e-07.

Epoch 00079: loss improved from 0.00203 to 0.00202, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 80/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00080: loss improved from 0.00202 to 0.00202, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 81/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00081: loss did not improve from 0.00202
Epoch 82/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00082: loss improved from 0.00202 to 0.00202, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 83/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00083: ReduceLROnPlateau reducing learning rate to 1e-07.

Epoch 00083: loss did not improve from 0.00202
Epoch 84/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00084: loss did not improve from 0.00202
Epoch 85/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00085: loss did not improve from 0.00202
Epoch 86/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00086: loss did not improve from 0.00202
Epoch 87/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00087: ReduceLROnPlateau reducing learning rate to 1e-07.

Epoch 00087: loss did not improve from 0.00202
Epoch 88/1000
 - 62s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00088: loss improved from 0.00202 to 0.00201, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 89/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00089: loss improved from 0.00201 to 0.00201, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 90/1000
 - 62s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00090: loss improved from 0.00201 to 0.00200, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 91/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00091: ReduceLROnPlateau reducing learning rate to 1e-07.

Epoch 00091: loss did not improve from 0.00200
Epoch 92/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00092: loss did not improve from 0.00200
Epoch 93/1000
 - 62s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00093: loss did not improve from 0.00200
Epoch 94/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00094: loss improved from 0.00200 to 0.00200, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 95/1000
 - 62s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00095: ReduceLROnPlateau reducing learning rate to 1e-07.

Epoch 00095: loss did not improve from 0.00200
Epoch 96/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00096: loss improved from 0.00200 to 0.00200, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 97/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00097: loss did not improve from 0.00200
Epoch 98/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00098: loss improved from 0.00200 to 0.00199, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 99/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00099: ReduceLROnPlateau reducing learning rate to 1e-07.

Epoch 00099: loss did not improve from 0.00199
Epoch 100/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00100: loss improved from 0.00199 to 0.00198, saving model to weights/segmentation/2019-03-27 13-59-56.hdf5
Epoch 101/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00101: loss did not improve from 0.00198
Epoch 102/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00102: loss did not improve from 0.00198
Epoch 103/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00103: ReduceLROnPlateau reducing learning rate to 1e-07.

Epoch 00103: loss did not improve from 0.00198
Epoch 104/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00104: loss did not improve from 0.00198
Epoch 105/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00105: loss did not improve from 0.00198
Epoch 106/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00106: loss did not improve from 0.00198
Epoch 107/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00107: ReduceLROnPlateau reducing learning rate to 1e-07.

Epoch 00107: loss did not improve from 0.00198
Epoch 108/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00108: loss did not improve from 0.00198
Epoch 109/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00109: loss did not improve from 0.00198
Epoch 110/1000
 - 63s - loss: 0.0020 - categorical_accuracy: 0.9990

Epoch 00110: loss did not improve from 0.00198
Epoch 00110: early stopping
Finished training

Date and time: 2019-03-27 15-55-50

