Date and time: 2019-03-26 10-04-18

Datasets used: ['/home/vostankovich/CycleGANToD/results/day2night_inno_cyclegan/test_latest/images']

894
447
DOING AUGMENTATION
DOING GAN
Model summary:
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
data (InputLayer)               (None, 256, 640, 3)  0                                            
__________________________________________________________________________________________________
bn_data (BatchNormalization)    (None, 256, 640, 3)  9           data[0][0]                       
__________________________________________________________________________________________________
zero_padding2d_1 (ZeroPadding2D (None, 262, 646, 3)  0           bn_data[0][0]                    
__________________________________________________________________________________________________
conv0 (Conv2D)                  (None, 128, 320, 64) 9408        zero_padding2d_1[0][0]           
__________________________________________________________________________________________________
bn0 (BatchNormalization)        (None, 128, 320, 64) 256         conv0[0][0]                      
__________________________________________________________________________________________________
relu0 (Activation)              (None, 128, 320, 64) 0           bn0[0][0]                        
__________________________________________________________________________________________________
zero_padding2d_2 (ZeroPadding2D (None, 130, 322, 64) 0           relu0[0][0]                      
__________________________________________________________________________________________________
pooling0 (MaxPooling2D)         (None, 64, 160, 64)  0           zero_padding2d_2[0][0]           
__________________________________________________________________________________________________
stage1_unit1_bn1 (BatchNormaliz (None, 64, 160, 64)  256         pooling0[0][0]                   
__________________________________________________________________________________________________
stage1_unit1_relu1 (Activation) (None, 64, 160, 64)  0           stage1_unit1_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_3 (ZeroPadding2D (None, 66, 162, 64)  0           stage1_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage1_unit1_conv1 (Conv2D)     (None, 64, 160, 64)  36864       zero_padding2d_3[0][0]           
__________________________________________________________________________________________________
stage1_unit1_bn2 (BatchNormaliz (None, 64, 160, 64)  256         stage1_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage1_unit1_relu2 (Activation) (None, 64, 160, 64)  0           stage1_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_4 (ZeroPadding2D (None, 66, 162, 64)  0           stage1_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage1_unit1_conv2 (Conv2D)     (None, 64, 160, 64)  36864       zero_padding2d_4[0][0]           
__________________________________________________________________________________________________
stage1_unit1_sc (Conv2D)        (None, 64, 160, 64)  4096        stage1_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_1 (Add)                     (None, 64, 160, 64)  0           stage1_unit1_conv2[0][0]         
                                                                 stage1_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage1_unit2_bn1 (BatchNormaliz (None, 64, 160, 64)  256         add_1[0][0]                      
__________________________________________________________________________________________________
stage1_unit2_relu1 (Activation) (None, 64, 160, 64)  0           stage1_unit2_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_5 (ZeroPadding2D (None, 66, 162, 64)  0           stage1_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage1_unit2_conv1 (Conv2D)     (None, 64, 160, 64)  36864       zero_padding2d_5[0][0]           
__________________________________________________________________________________________________
stage1_unit2_bn2 (BatchNormaliz (None, 64, 160, 64)  256         stage1_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage1_unit2_relu2 (Activation) (None, 64, 160, 64)  0           stage1_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_6 (ZeroPadding2D (None, 66, 162, 64)  0           stage1_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage1_unit2_conv2 (Conv2D)     (None, 64, 160, 64)  36864       zero_padding2d_6[0][0]           
__________________________________________________________________________________________________
add_2 (Add)                     (None, 64, 160, 64)  0           stage1_unit2_conv2[0][0]         
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
stage2_unit1_bn1 (BatchNormaliz (None, 64, 160, 64)  256         add_2[0][0]                      
__________________________________________________________________________________________________
stage2_unit1_relu1 (Activation) (None, 64, 160, 64)  0           stage2_unit1_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_7 (ZeroPadding2D (None, 66, 162, 64)  0           stage2_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage2_unit1_conv1 (Conv2D)     (None, 32, 80, 128)  73728       zero_padding2d_7[0][0]           
__________________________________________________________________________________________________
stage2_unit1_bn2 (BatchNormaliz (None, 32, 80, 128)  512         stage2_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage2_unit1_relu2 (Activation) (None, 32, 80, 128)  0           stage2_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_8 (ZeroPadding2D (None, 34, 82, 128)  0           stage2_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage2_unit1_conv2 (Conv2D)     (None, 32, 80, 128)  147456      zero_padding2d_8[0][0]           
__________________________________________________________________________________________________
stage2_unit1_sc (Conv2D)        (None, 32, 80, 128)  8192        stage2_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_3 (Add)                     (None, 32, 80, 128)  0           stage2_unit1_conv2[0][0]         
                                                                 stage2_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage2_unit2_bn1 (BatchNormaliz (None, 32, 80, 128)  512         add_3[0][0]                      
__________________________________________________________________________________________________
stage2_unit2_relu1 (Activation) (None, 32, 80, 128)  0           stage2_unit2_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_9 (ZeroPadding2D (None, 34, 82, 128)  0           stage2_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage2_unit2_conv1 (Conv2D)     (None, 32, 80, 128)  147456      zero_padding2d_9[0][0]           
__________________________________________________________________________________________________
stage2_unit2_bn2 (BatchNormaliz (None, 32, 80, 128)  512         stage2_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage2_unit2_relu2 (Activation) (None, 32, 80, 128)  0           stage2_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_10 (ZeroPadding2 (None, 34, 82, 128)  0           stage2_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage2_unit2_conv2 (Conv2D)     (None, 32, 80, 128)  147456      zero_padding2d_10[0][0]          
__________________________________________________________________________________________________
add_4 (Add)                     (None, 32, 80, 128)  0           stage2_unit2_conv2[0][0]         
                                                                 add_3[0][0]                      
__________________________________________________________________________________________________
stage3_unit1_bn1 (BatchNormaliz (None, 32, 80, 128)  512         add_4[0][0]                      
__________________________________________________________________________________________________
stage3_unit1_relu1 (Activation) (None, 32, 80, 128)  0           stage3_unit1_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_11 (ZeroPadding2 (None, 34, 82, 128)  0           stage3_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage3_unit1_conv1 (Conv2D)     (None, 16, 40, 256)  294912      zero_padding2d_11[0][0]          
__________________________________________________________________________________________________
stage3_unit1_bn2 (BatchNormaliz (None, 16, 40, 256)  1024        stage3_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage3_unit1_relu2 (Activation) (None, 16, 40, 256)  0           stage3_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_12 (ZeroPadding2 (None, 18, 42, 256)  0           stage3_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage3_unit1_conv2 (Conv2D)     (None, 16, 40, 256)  589824      zero_padding2d_12[0][0]          
__________________________________________________________________________________________________
stage3_unit1_sc (Conv2D)        (None, 16, 40, 256)  32768       stage3_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_5 (Add)                     (None, 16, 40, 256)  0           stage3_unit1_conv2[0][0]         
                                                                 stage3_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage3_unit2_bn1 (BatchNormaliz (None, 16, 40, 256)  1024        add_5[0][0]                      
__________________________________________________________________________________________________
stage3_unit2_relu1 (Activation) (None, 16, 40, 256)  0           stage3_unit2_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_13 (ZeroPadding2 (None, 18, 42, 256)  0           stage3_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage3_unit2_conv1 (Conv2D)     (None, 16, 40, 256)  589824      zero_padding2d_13[0][0]          
__________________________________________________________________________________________________
stage3_unit2_bn2 (BatchNormaliz (None, 16, 40, 256)  1024        stage3_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage3_unit2_relu2 (Activation) (None, 16, 40, 256)  0           stage3_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_14 (ZeroPadding2 (None, 18, 42, 256)  0           stage3_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage3_unit2_conv2 (Conv2D)     (None, 16, 40, 256)  589824      zero_padding2d_14[0][0]          
__________________________________________________________________________________________________
add_6 (Add)                     (None, 16, 40, 256)  0           stage3_unit2_conv2[0][0]         
                                                                 add_5[0][0]                      
__________________________________________________________________________________________________
stage4_unit1_bn1 (BatchNormaliz (None, 16, 40, 256)  1024        add_6[0][0]                      
__________________________________________________________________________________________________
stage4_unit1_relu1 (Activation) (None, 16, 40, 256)  0           stage4_unit1_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_15 (ZeroPadding2 (None, 18, 42, 256)  0           stage4_unit1_relu1[0][0]         
__________________________________________________________________________________________________
stage4_unit1_conv1 (Conv2D)     (None, 8, 20, 512)   1179648     zero_padding2d_15[0][0]          
__________________________________________________________________________________________________
stage4_unit1_bn2 (BatchNormaliz (None, 8, 20, 512)   2048        stage4_unit1_conv1[0][0]         
__________________________________________________________________________________________________
stage4_unit1_relu2 (Activation) (None, 8, 20, 512)   0           stage4_unit1_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_16 (ZeroPadding2 (None, 10, 22, 512)  0           stage4_unit1_relu2[0][0]         
__________________________________________________________________________________________________
stage4_unit1_conv2 (Conv2D)     (None, 8, 20, 512)   2359296     zero_padding2d_16[0][0]          
__________________________________________________________________________________________________
stage4_unit1_sc (Conv2D)        (None, 8, 20, 512)   131072      stage4_unit1_relu1[0][0]         
__________________________________________________________________________________________________
add_7 (Add)                     (None, 8, 20, 512)   0           stage4_unit1_conv2[0][0]         
                                                                 stage4_unit1_sc[0][0]            
__________________________________________________________________________________________________
stage4_unit2_bn1 (BatchNormaliz (None, 8, 20, 512)   2048        add_7[0][0]                      
__________________________________________________________________________________________________
stage4_unit2_relu1 (Activation) (None, 8, 20, 512)   0           stage4_unit2_bn1[0][0]           
__________________________________________________________________________________________________
zero_padding2d_17 (ZeroPadding2 (None, 10, 22, 512)  0           stage4_unit2_relu1[0][0]         
__________________________________________________________________________________________________
stage4_unit2_conv1 (Conv2D)     (None, 8, 20, 512)   2359296     zero_padding2d_17[0][0]          
__________________________________________________________________________________________________
stage4_unit2_bn2 (BatchNormaliz (None, 8, 20, 512)   2048        stage4_unit2_conv1[0][0]         
__________________________________________________________________________________________________
stage4_unit2_relu2 (Activation) (None, 8, 20, 512)   0           stage4_unit2_bn2[0][0]           
__________________________________________________________________________________________________
zero_padding2d_18 (ZeroPadding2 (None, 10, 22, 512)  0           stage4_unit2_relu2[0][0]         
__________________________________________________________________________________________________
stage4_unit2_conv2 (Conv2D)     (None, 8, 20, 512)   2359296     zero_padding2d_18[0][0]          
__________________________________________________________________________________________________
add_8 (Add)                     (None, 8, 20, 512)   0           stage4_unit2_conv2[0][0]         
                                                                 add_7[0][0]                      
__________________________________________________________________________________________________
bn1 (BatchNormalization)        (None, 8, 20, 512)   2048        add_8[0][0]                      
__________________________________________________________________________________________________
relu1 (Activation)              (None, 8, 20, 512)   0           bn1[0][0]                        
__________________________________________________________________________________________________
decoder_stage0_conv1 (Conv2D)   (None, 8, 20, 128)   65536       relu1[0][0]                      
__________________________________________________________________________________________________
decoder_stage0_bn1 (BatchNormal (None, 8, 20, 128)   512         decoder_stage0_conv1[0][0]       
__________________________________________________________________________________________________
decoder_stage0_relu1 (Activatio (None, 8, 20, 128)   0           decoder_stage0_bn1[0][0]         
__________________________________________________________________________________________________
decoder_stage0_upsample2 (UpSam (None, 16, 40, 128)  0           decoder_stage0_relu1[0][0]       
__________________________________________________________________________________________________
decoder_stage0_conv2 (Conv2D)   (None, 16, 40, 128)  147456      decoder_stage0_upsample2[0][0]   
__________________________________________________________________________________________________
decoder_stage0_bn2 (BatchNormal (None, 16, 40, 128)  512         decoder_stage0_conv2[0][0]       
__________________________________________________________________________________________________
decoder_stage0_relu2 (Activatio (None, 16, 40, 128)  0           decoder_stage0_bn2[0][0]         
__________________________________________________________________________________________________
decoder_stage0_conv3 (Conv2D)   (None, 16, 40, 256)  32768       decoder_stage0_relu2[0][0]       
__________________________________________________________________________________________________
decoder_stage0_bn3 (BatchNormal (None, 16, 40, 256)  1024        decoder_stage0_conv3[0][0]       
__________________________________________________________________________________________________
decoder_stage0_relu3 (Activatio (None, 16, 40, 256)  0           decoder_stage0_bn3[0][0]         
__________________________________________________________________________________________________
add_9 (Add)                     (None, 16, 40, 256)  0           decoder_stage0_relu3[0][0]       
                                                                 stage4_unit1_relu1[0][0]         
__________________________________________________________________________________________________
decoder_stage1_conv1 (Conv2D)   (None, 16, 40, 64)   16384       add_9[0][0]                      
__________________________________________________________________________________________________
decoder_stage1_bn1 (BatchNormal (None, 16, 40, 64)   256         decoder_stage1_conv1[0][0]       
__________________________________________________________________________________________________
decoder_stage1_relu1 (Activatio (None, 16, 40, 64)   0           decoder_stage1_bn1[0][0]         
__________________________________________________________________________________________________
decoder_stage1_upsample2 (UpSam (None, 32, 80, 64)   0           decoder_stage1_relu1[0][0]       
__________________________________________________________________________________________________
decoder_stage1_conv2 (Conv2D)   (None, 32, 80, 64)   36864       decoder_stage1_upsample2[0][0]   
__________________________________________________________________________________________________
decoder_stage1_bn2 (BatchNormal (None, 32, 80, 64)   256         decoder_stage1_conv2[0][0]       
__________________________________________________________________________________________________
decoder_stage1_relu2 (Activatio (None, 32, 80, 64)   0           decoder_stage1_bn2[0][0]         
__________________________________________________________________________________________________
decoder_stage1_conv3 (Conv2D)   (None, 32, 80, 128)  8192        decoder_stage1_relu2[0][0]       
__________________________________________________________________________________________________
decoder_stage1_bn3 (BatchNormal (None, 32, 80, 128)  512         decoder_stage1_conv3[0][0]       
__________________________________________________________________________________________________
decoder_stage1_relu3 (Activatio (None, 32, 80, 128)  0           decoder_stage1_bn3[0][0]         
__________________________________________________________________________________________________
add_10 (Add)                    (None, 32, 80, 128)  0           decoder_stage1_relu3[0][0]       
                                                                 stage3_unit1_relu1[0][0]         
__________________________________________________________________________________________________
decoder_stage2_conv1 (Conv2D)   (None, 32, 80, 32)   4096        add_10[0][0]                     
__________________________________________________________________________________________________
decoder_stage2_bn1 (BatchNormal (None, 32, 80, 32)   128         decoder_stage2_conv1[0][0]       
__________________________________________________________________________________________________
decoder_stage2_relu1 (Activatio (None, 32, 80, 32)   0           decoder_stage2_bn1[0][0]         
__________________________________________________________________________________________________
decoder_stage2_upsample2 (UpSam (None, 64, 160, 32)  0           decoder_stage2_relu1[0][0]       
__________________________________________________________________________________________________
decoder_stage2_conv2 (Conv2D)   (None, 64, 160, 32)  9216        decoder_stage2_upsample2[0][0]   
__________________________________________________________________________________________________
decoder_stage2_bn2 (BatchNormal (None, 64, 160, 32)  128         decoder_stage2_conv2[0][0]       
__________________________________________________________________________________________________
decoder_stage2_relu2 (Activatio (None, 64, 160, 32)  0           decoder_stage2_bn2[0][0]         
__________________________________________________________________________________________________
decoder_stage2_conv3 (Conv2D)   (None, 64, 160, 64)  2048        decoder_stage2_relu2[0][0]       
__________________________________________________________________________________________________
decoder_stage2_bn3 (BatchNormal (None, 64, 160, 64)  256         decoder_stage2_conv3[0][0]       
__________________________________________________________________________________________________
decoder_stage2_relu3 (Activatio (None, 64, 160, 64)  0           decoder_stage2_bn3[0][0]         
__________________________________________________________________________________________________
add_11 (Add)                    (None, 64, 160, 64)  0           decoder_stage2_relu3[0][0]       
                                                                 stage2_unit1_relu1[0][0]         
__________________________________________________________________________________________________
decoder_stage3_conv1 (Conv2D)   (None, 64, 160, 16)  1024        add_11[0][0]                     
__________________________________________________________________________________________________
decoder_stage3_bn1 (BatchNormal (None, 64, 160, 16)  64          decoder_stage3_conv1[0][0]       
__________________________________________________________________________________________________
decoder_stage3_relu1 (Activatio (None, 64, 160, 16)  0           decoder_stage3_bn1[0][0]         
__________________________________________________________________________________________________
decoder_stage3_upsample2 (UpSam (None, 128, 320, 16) 0           decoder_stage3_relu1[0][0]       
__________________________________________________________________________________________________
decoder_stage3_conv2 (Conv2D)   (None, 128, 320, 16) 2304        decoder_stage3_upsample2[0][0]   
__________________________________________________________________________________________________
decoder_stage3_bn2 (BatchNormal (None, 128, 320, 16) 64          decoder_stage3_conv2[0][0]       
__________________________________________________________________________________________________
decoder_stage3_relu2 (Activatio (None, 128, 320, 16) 0           decoder_stage3_bn2[0][0]         
__________________________________________________________________________________________________
decoder_stage3_conv3 (Conv2D)   (None, 128, 320, 64) 1024        decoder_stage3_relu2[0][0]       
__________________________________________________________________________________________________
decoder_stage3_bn3 (BatchNormal (None, 128, 320, 64) 256         decoder_stage3_conv3[0][0]       
__________________________________________________________________________________________________
decoder_stage3_relu3 (Activatio (None, 128, 320, 64) 0           decoder_stage3_bn3[0][0]         
__________________________________________________________________________________________________
add_12 (Add)                    (None, 128, 320, 64) 0           decoder_stage3_relu3[0][0]       
                                                                 relu0[0][0]                      
__________________________________________________________________________________________________
decoder_stage4_conv1 (Conv2D)   (None, 128, 320, 16) 1024        add_12[0][0]                     
__________________________________________________________________________________________________
decoder_stage4_bn1 (BatchNormal (None, 128, 320, 16) 64          decoder_stage4_conv1[0][0]       
__________________________________________________________________________________________________
decoder_stage4_relu1 (Activatio (None, 128, 320, 16) 0           decoder_stage4_bn1[0][0]         
__________________________________________________________________________________________________
decoder_stage4_upsample2 (UpSam (None, 256, 640, 16) 0           decoder_stage4_relu1[0][0]       
__________________________________________________________________________________________________
decoder_stage4_conv2 (Conv2D)   (None, 256, 640, 16) 2304        decoder_stage4_upsample2[0][0]   
__________________________________________________________________________________________________
decoder_stage4_bn2 (BatchNormal (None, 256, 640, 16) 64          decoder_stage4_conv2[0][0]       
__________________________________________________________________________________________________
decoder_stage4_relu2 (Activatio (None, 256, 640, 16) 0           decoder_stage4_bn2[0][0]         
__________________________________________________________________________________________________
decoder_stage4_conv3 (Conv2D)   (None, 256, 640, 16) 256         decoder_stage4_relu2[0][0]       
__________________________________________________________________________________________________
decoder_stage4_bn3 (BatchNormal (None, 256, 640, 16) 64          decoder_stage4_conv3[0][0]       
__________________________________________________________________________________________________
decoder_stage4_relu3 (Activatio (None, 256, 640, 16) 0           decoder_stage4_bn3[0][0]         
__________________________________________________________________________________________________
final_conv (Conv2D)             (None, 256, 640, 3)  435         decoder_stage4_relu3[0][0]       
__________________________________________________________________________________________________
softmax (Activation)            (None, 256, 640, 3)  0           final_conv[0][0]                 
==================================================================================================
Total params: 11,521,980
Trainable params: 11,511,958
Non-trainable params: 10,022
__________________________________________________________________________________________________
Optimizer: <keras.optimizers.Adam object at 0x7fbf0f2cf1d0>, learning rate: 0.0001, loss: ['categorical_crossentropy'], metrics: ['categorical_accuracy']

Callbacks: [<keras.callbacks.ModelCheckpoint object at 0x7fc04dc3ff98>, <keras.callbacks.ReduceLROnPlateau object at 0x7fc04dc3f668>, <keras.callbacks.EarlyStopping object at 0x7fc04dc3f6d8>, <keras.callbacks.CSVLogger object at 0x7fc04dbc8c88>]

Steps per epoch: 894
Starting training...

Epoch 1/1000
 - 71s - loss: 0.3646 - categorical_accuracy: 0.8623

Epoch 00001: loss improved from inf to 0.36456, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 2/1000
 - 64s - loss: 0.1671 - categorical_accuracy: 0.9406

Epoch 00002: loss improved from 0.36456 to 0.16708, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 3/1000
 - 63s - loss: 0.1160 - categorical_accuracy: 0.9603

Epoch 00003: loss improved from 0.16708 to 0.11603, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 4/1000
 - 63s - loss: 0.0855 - categorical_accuracy: 0.9707

Epoch 00004: loss improved from 0.11603 to 0.08552, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 5/1000
 - 63s - loss: 0.0715 - categorical_accuracy: 0.9746

Epoch 00005: loss improved from 0.08552 to 0.07153, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 6/1000
 - 63s - loss: 0.0572 - categorical_accuracy: 0.9794

Epoch 00006: loss improved from 0.07153 to 0.05721, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 7/1000
 - 63s - loss: 0.0508 - categorical_accuracy: 0.9814

Epoch 00007: loss improved from 0.05721 to 0.05081, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 8/1000
 - 63s - loss: 0.0441 - categorical_accuracy: 0.9836

Epoch 00008: loss improved from 0.05081 to 0.04409, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 9/1000
 - 64s - loss: 0.0386 - categorical_accuracy: 0.9854

Epoch 00009: loss improved from 0.04409 to 0.03865, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 10/1000
 - 64s - loss: 0.0375 - categorical_accuracy: 0.9857

Epoch 00010: loss improved from 0.03865 to 0.03746, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 11/1000
 - 63s - loss: 0.0349 - categorical_accuracy: 0.9865

Epoch 00011: loss improved from 0.03746 to 0.03493, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 12/1000
 - 63s - loss: 0.0309 - categorical_accuracy: 0.9880

Epoch 00012: loss improved from 0.03493 to 0.03089, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 13/1000
 - 63s - loss: 0.0293 - categorical_accuracy: 0.9884

Epoch 00013: loss improved from 0.03089 to 0.02925, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 14/1000
 - 63s - loss: 0.0281 - categorical_accuracy: 0.9889

Epoch 00014: loss improved from 0.02925 to 0.02810, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 15/1000
 - 63s - loss: 0.0283 - categorical_accuracy: 0.9888

Epoch 00015: loss did not improve from 0.02810
Epoch 16/1000
 - 63s - loss: 0.0259 - categorical_accuracy: 0.9898

Epoch 00016: loss improved from 0.02810 to 0.02587, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 17/1000
 - 63s - loss: 0.0238 - categorical_accuracy: 0.9904

Epoch 00017: loss improved from 0.02587 to 0.02378, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 18/1000
 - 63s - loss: 0.0215 - categorical_accuracy: 0.9914

Epoch 00018: loss improved from 0.02378 to 0.02149, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 19/1000
 - 63s - loss: 0.0209 - categorical_accuracy: 0.9916

Epoch 00019: loss improved from 0.02149 to 0.02089, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 20/1000
 - 63s - loss: 0.0201 - categorical_accuracy: 0.9919

Epoch 00020: loss improved from 0.02089 to 0.02005, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 21/1000
 - 64s - loss: 0.0212 - categorical_accuracy: 0.9914

Epoch 00021: loss did not improve from 0.02005
Epoch 22/1000
 - 64s - loss: 0.0227 - categorical_accuracy: 0.9912

Epoch 00022: loss did not improve from 0.02005
Epoch 23/1000
 - 64s - loss: 0.0150 - categorical_accuracy: 0.9940

Epoch 00023: loss improved from 0.02005 to 0.01501, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 24/1000
 - 64s - loss: 0.0134 - categorical_accuracy: 0.9945

Epoch 00024: loss improved from 0.01501 to 0.01336, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 25/1000
 - 63s - loss: 0.0159 - categorical_accuracy: 0.9934

Epoch 00025: loss did not improve from 0.01336
Epoch 26/1000
 - 63s - loss: 0.0154 - categorical_accuracy: 0.9937

Epoch 00026: loss did not improve from 0.01336
Epoch 27/1000
 - 62s - loss: 0.0160 - categorical_accuracy: 0.9934

Epoch 00027: loss did not improve from 0.01336
Epoch 28/1000
 - 61s - loss: 0.0196 - categorical_accuracy: 0.9922

Epoch 00028: loss did not improve from 0.01336

Epoch 00028: ReduceLROnPlateau reducing learning rate to 4.999999873689376e-05.
Epoch 29/1000
 - 62s - loss: 0.0128 - categorical_accuracy: 0.9949

Epoch 00029: loss improved from 0.01336 to 0.01276, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 30/1000
 - 62s - loss: 0.0077 - categorical_accuracy: 0.9969

Epoch 00030: loss improved from 0.01276 to 0.00768, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 31/1000
 - 62s - loss: 0.0077 - categorical_accuracy: 0.9969

Epoch 00031: loss did not improve from 0.00768
Epoch 32/1000
 - 62s - loss: 0.0095 - categorical_accuracy: 0.9961

Epoch 00032: loss did not improve from 0.00768
Epoch 33/1000
 - 63s - loss: 0.0101 - categorical_accuracy: 0.9958

Epoch 00033: loss did not improve from 0.00768
Epoch 34/1000
 - 63s - loss: 0.0104 - categorical_accuracy: 0.9957

Epoch 00034: loss did not improve from 0.00768

Epoch 00034: ReduceLROnPlateau reducing learning rate to 2.499999936844688e-05.
Epoch 35/1000
 - 63s - loss: 0.0085 - categorical_accuracy: 0.9965

Epoch 00035: loss did not improve from 0.00768
Epoch 36/1000
 - 63s - loss: 0.0053 - categorical_accuracy: 0.9979

Epoch 00036: loss improved from 0.00768 to 0.00534, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 37/1000
 - 63s - loss: 0.0058 - categorical_accuracy: 0.9976

Epoch 00037: loss did not improve from 0.00534
Epoch 38/1000
 - 63s - loss: 0.0066 - categorical_accuracy: 0.9972

Epoch 00038: loss did not improve from 0.00534
Epoch 39/1000
 - 63s - loss: 0.0063 - categorical_accuracy: 0.9974

Epoch 00039: loss did not improve from 0.00534
Epoch 40/1000
 - 63s - loss: 0.0064 - categorical_accuracy: 0.9973

Epoch 00040: loss did not improve from 0.00534

Epoch 00040: ReduceLROnPlateau reducing learning rate to 1.249999968422344e-05.
Epoch 41/1000
 - 63s - loss: 0.0061 - categorical_accuracy: 0.9975

Epoch 00041: loss did not improve from 0.00534
Epoch 42/1000
 - 62s - loss: 0.0042 - categorical_accuracy: 0.9983

Epoch 00042: loss improved from 0.00534 to 0.00423, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 43/1000
 - 62s - loss: 0.0038 - categorical_accuracy: 0.9985

Epoch 00043: loss improved from 0.00423 to 0.00384, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 44/1000
 - 63s - loss: 0.0039 - categorical_accuracy: 0.9984

Epoch 00044: loss did not improve from 0.00384
Epoch 45/1000
 - 63s - loss: 0.0041 - categorical_accuracy: 0.9983

Epoch 00045: loss did not improve from 0.00384
Epoch 46/1000
 - 63s - loss: 0.0040 - categorical_accuracy: 0.9983

Epoch 00046: loss did not improve from 0.00384
Epoch 47/1000
 - 64s - loss: 0.0039 - categorical_accuracy: 0.9984

Epoch 00047: loss did not improve from 0.00384

Epoch 00047: ReduceLROnPlateau reducing learning rate to 6.24999984211172e-06.
Epoch 48/1000
 - 63s - loss: 0.0041 - categorical_accuracy: 0.9983

Epoch 00048: loss did not improve from 0.00384
Epoch 49/1000
 - 63s - loss: 0.0034 - categorical_accuracy: 0.9986

Epoch 00049: loss improved from 0.00384 to 0.00344, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 50/1000
 - 63s - loss: 0.0032 - categorical_accuracy: 0.9987

Epoch 00050: loss improved from 0.00344 to 0.00319, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 51/1000
 - 63s - loss: 0.0031 - categorical_accuracy: 0.9988

Epoch 00051: loss improved from 0.00319 to 0.00310, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 52/1000
 - 63s - loss: 0.0030 - categorical_accuracy: 0.9988

Epoch 00052: loss improved from 0.00310 to 0.00304, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 53/1000
 - 63s - loss: 0.0030 - categorical_accuracy: 0.9988

Epoch 00053: loss improved from 0.00304 to 0.00304, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 54/1000
 - 63s - loss: 0.0030 - categorical_accuracy: 0.9988

Epoch 00054: loss improved from 0.00304 to 0.00301, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 55/1000
 - 62s - loss: 0.0029 - categorical_accuracy: 0.9988

Epoch 00055: loss improved from 0.00301 to 0.00291, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 56/1000
 - 63s - loss: 0.0029 - categorical_accuracy: 0.9988

Epoch 00056: loss improved from 0.00291 to 0.00291, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 57/1000
 - 63s - loss: 0.0029 - categorical_accuracy: 0.9988

Epoch 00057: loss did not improve from 0.00291
Epoch 58/1000
 - 63s - loss: 0.0030 - categorical_accuracy: 0.9988

Epoch 00058: loss did not improve from 0.00291
Epoch 59/1000
 - 63s - loss: 0.0029 - categorical_accuracy: 0.9988

Epoch 00059: loss did not improve from 0.00291

Epoch 00059: ReduceLROnPlateau reducing learning rate to 3.12499992105586e-06.
Epoch 60/1000
 - 63s - loss: 0.0030 - categorical_accuracy: 0.9988

Epoch 00060: loss did not improve from 0.00291
Epoch 61/1000
 - 63s - loss: 0.0027 - categorical_accuracy: 0.9989

Epoch 00061: loss improved from 0.00291 to 0.00267, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 62/1000
 - 62s - loss: 0.0026 - categorical_accuracy: 0.9990

Epoch 00062: loss improved from 0.00267 to 0.00258, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 63/1000
 - 64s - loss: 0.0026 - categorical_accuracy: 0.9990

Epoch 00063: loss improved from 0.00258 to 0.00256, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 64/1000
 - 63s - loss: 0.0025 - categorical_accuracy: 0.9990

Epoch 00064: loss improved from 0.00256 to 0.00251, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 65/1000
 - 63s - loss: 0.0025 - categorical_accuracy: 0.9990

Epoch 00065: loss did not improve from 0.00251
Epoch 66/1000
 - 63s - loss: 0.0025 - categorical_accuracy: 0.9990

Epoch 00066: loss improved from 0.00251 to 0.00247, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 67/1000
 - 64s - loss: 0.0025 - categorical_accuracy: 0.9990

Epoch 00067: loss improved from 0.00247 to 0.00245, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 68/1000
 - 64s - loss: 0.0024 - categorical_accuracy: 0.9990

Epoch 00068: loss improved from 0.00245 to 0.00243, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 69/1000
 - 64s - loss: 0.0024 - categorical_accuracy: 0.9991

Epoch 00069: loss improved from 0.00243 to 0.00240, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 70/1000
 - 64s - loss: 0.0024 - categorical_accuracy: 0.9991

Epoch 00070: loss improved from 0.00240 to 0.00240, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 71/1000
 - 64s - loss: 0.0024 - categorical_accuracy: 0.9991

Epoch 00071: loss improved from 0.00240 to 0.00236, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5

Epoch 00071: ReduceLROnPlateau reducing learning rate to 1.56249996052793e-06.
Epoch 72/1000
 - 64s - loss: 0.0023 - categorical_accuracy: 0.9991

Epoch 00072: loss improved from 0.00236 to 0.00232, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 73/1000
 - 64s - loss: 0.0023 - categorical_accuracy: 0.9991

Epoch 00073: loss improved from 0.00232 to 0.00230, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 74/1000
 - 64s - loss: 0.0023 - categorical_accuracy: 0.9991

Epoch 00074: loss improved from 0.00230 to 0.00228, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 75/1000
 - 64s - loss: 0.0023 - categorical_accuracy: 0.9991

Epoch 00075: loss did not improve from 0.00228
Epoch 76/1000
 - 64s - loss: 0.0023 - categorical_accuracy: 0.9991

Epoch 00076: loss improved from 0.00228 to 0.00226, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5

Epoch 00076: ReduceLROnPlateau reducing learning rate to 7.81249980263965e-07.
Epoch 77/1000
 - 64s - loss: 0.0023 - categorical_accuracy: 0.9991

Epoch 00077: loss did not improve from 0.00226
Epoch 78/1000
 - 64s - loss: 0.0023 - categorical_accuracy: 0.9991

Epoch 00078: loss improved from 0.00226 to 0.00225, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 79/1000
 - 64s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00079: loss improved from 0.00225 to 0.00222, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 80/1000
 - 64s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00080: loss did not improve from 0.00222

Epoch 00080: ReduceLROnPlateau reducing learning rate to 3.906249901319825e-07.
Epoch 81/1000
 - 64s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00081: loss did not improve from 0.00222
Epoch 82/1000
 - 64s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00082: loss did not improve from 0.00222
Epoch 83/1000
 - 65s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00083: loss did not improve from 0.00222
Epoch 84/1000
 - 63s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00084: loss improved from 0.00222 to 0.00219, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 85/1000
 - 64s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00085: loss did not improve from 0.00219
Epoch 86/1000
 - 65s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00086: loss improved from 0.00219 to 0.00218, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 87/1000
 - 64s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00087: loss did not improve from 0.00218
Epoch 88/1000
 - 64s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00088: loss did not improve from 0.00218

Epoch 00088: ReduceLROnPlateau reducing learning rate to 1.9531249506599124e-07.
Epoch 89/1000
 - 64s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00089: loss did not improve from 0.00218
Epoch 90/1000
 - 64s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00090: loss did not improve from 0.00218
Epoch 91/1000
 - 64s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00091: loss improved from 0.00218 to 0.00218, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 92/1000
 - 63s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00092: loss did not improve from 0.00218

Epoch 00092: ReduceLROnPlateau reducing learning rate to 1e-07.
Epoch 93/1000
 - 65s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00093: loss did not improve from 0.00218
Epoch 94/1000
 - 64s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00094: loss did not improve from 0.00218
Epoch 95/1000
 - 64s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00095: loss did not improve from 0.00218
Epoch 96/1000
 - 64s - loss: 0.0022 - categorical_accuracy: 0.9992

Epoch 00096: loss did not improve from 0.00218

Epoch 00096: ReduceLROnPlateau reducing learning rate to 1e-07.
Epoch 97/1000
 - 66s - loss: 0.0022 - categorical_accuracy: 0.9992

Epoch 00097: loss improved from 0.00218 to 0.00217, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 98/1000
 - 65s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00098: loss did not improve from 0.00217
Epoch 99/1000
 - 66s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00099: loss did not improve from 0.00217
Epoch 100/1000
 - 65s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00100: loss did not improve from 0.00217

Epoch 00100: ReduceLROnPlateau reducing learning rate to 1e-07.
Epoch 101/1000
 - 66s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00101: loss did not improve from 0.00217
Epoch 102/1000
 - 65s - loss: 0.0022 - categorical_accuracy: 0.9992

Epoch 00102: loss improved from 0.00217 to 0.00217, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 103/1000
 - 65s - loss: 0.0022 - categorical_accuracy: 0.9992

Epoch 00103: loss improved from 0.00217 to 0.00216, saving model to weights/segmentation/2019-03-26 10-04-18.hdf5
Epoch 104/1000
 - 65s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00104: loss did not improve from 0.00216

Epoch 00104: ReduceLROnPlateau reducing learning rate to 1e-07.
Epoch 105/1000
 - 65s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00105: loss did not improve from 0.00216
Epoch 106/1000
 - 65s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00106: loss did not improve from 0.00216
Epoch 107/1000
 - 65s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00107: loss did not improve from 0.00216
Epoch 108/1000
 - 65s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00108: loss did not improve from 0.00216

Epoch 00108: ReduceLROnPlateau reducing learning rate to 1e-07.
Epoch 109/1000
 - 65s - loss: 0.0022 - categorical_accuracy: 0.9992

Epoch 00109: loss did not improve from 0.00216
Epoch 110/1000
 - 65s - loss: 0.0022 - categorical_accuracy: 0.9992

Epoch 00110: loss did not improve from 0.00216
Epoch 111/1000
 - 65s - loss: 0.0022 - categorical_accuracy: 0.9992

Epoch 00111: loss did not improve from 0.00216
Epoch 112/1000
 - 65s - loss: 0.0022 - categorical_accuracy: 0.9992

Epoch 00112: loss did not improve from 0.00216

Epoch 00112: ReduceLROnPlateau reducing learning rate to 1e-07.
Epoch 113/1000
 - 65s - loss: 0.0022 - categorical_accuracy: 0.9991

Epoch 00113: loss did not improve from 0.00216
Epoch 00113: early stopping
Finished training

Date and time: 2019-03-26 12-04-36

